{
  "coverTitle": "The Ant and the Grasshopper",
  "coverAuthor": "A Beginning Reader for Lessons 24-26",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "It was summer. The sun was hot and bright. The grass was green. An ant was working hard. Lift, lift, lift!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The ant was storing food. She planted grass seeds in her nest. She was getting ready for winter. \"I must work fast!\" said the ant.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "A grasshopper hopped by. Hop, hop, hop! \"What are you doing?\" said the grasshopper. \"I am working!\" said the ant. \"I must plant food for winter!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The grasshopper laughed. \"It is summer!\" said the grasshopper. \"It is time to play! It is time to jump! It is time to sing!\" \"Spring and summer are for fun!\" said the grasshopper.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"I will rest when winter comes,\" said the grasshopper. \"But what will you eat in winter?\" said the ant. \"I will find food then!\" said the grasshopper. \"Come play with me!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"No,\" said the ant. \"I must work! Winter will come fast. I must be ready!\" And the ant kept working. Lift, lift, lift!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The grasshopper hopped away. Hop, hop, hop! He sang in the grass. He jumped in the sun. He rested under a tree. \"This is the best!\" said the grasshopper.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Summer went by. Then autumn came. The air got crisp. The ant still worked hard. Lift, lift, lift! The grasshopper still played. Hop, hop, hop!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Then winter came. It got cold. Frost was on the grass. The grass turned brown. There was no food left to find.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The grasshopper was cold. He was hungry. \"I have no food!\" said the grasshopper. \"I spent all summer playing! Now I have nothing!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The grasshopper went to the ant's nest. Knock, knock, knock! \"Please, can I have some food?\" said the grasshopper.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The ant came out. \"What did you do all summer?\" said the ant. \"I played and sang,\" said the grasshopper. \"I did not plan for winter.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The ant said, \"I worked all summer. I planted food. I stored food. Now I have plenty for winter.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"You spent your time playing. I spent my time working. Now you are hungry, and I am not.\" The lesson: Plan ahead! Work when it is time to work. Then you will have what you need! The end! Initial Blends: - PL: plant, plenty, play, plan - GR: grasshopper, grass, green - CR: crisp - TR: tree (tr-) - FR: frost - ST: still, store, stored - SP: spent, spring - SN: (not in this story but practice: snack, snap, snip) Final Blends: - -ST: best, last, just, fast, nest, frost, crisp (sp acts like final blend) - -ND: and, pland (planned) - -NT: ant, plant, went, spent - -LT: (not in this story but practice: melt, belt) - -MP: jump Mega Blend Practice Sentence: \"The grasshopper will play and jump in the green grass, but the ant will plan and store food fast for winter when there is frost!\" \"Lift, lift, lift!\" \"Hop, hop, hop!\" \"I must work fast!\" \"I spent all summer playing!\" \"Plan ahead!\" 1. What season was it at the beginning? (summer) 2. What was the ant doing? (working, planting, storing food) 3. What was the grasshopper doing? (playing, singing, jumping, resting) 4. What happened when winter came? (it got cold, no food) 5. Who had food? (the ant) 6. Who did NOT have food? (the grasshopper) 7. Why didn't the grasshopper have food? (he played all summer instead of working) 8. What is the lesson? The Ant's Choice: - WORK in summer → HAVE FOOD in winter ✅ The Grasshopper's Choice: - PLAY in summer → NO FOOD in winter ❌ Questions: - Which choice was smarter? - Have YOU ever had to work first, then play later? - What happens if you play BEFORE finishing your work? Examples: - Homework FIRST, then video games ✅ - Reading practice FIRST, then TV ✅ - Clean room FIRST, then play outside ✅ Summer: Warm, lots of food growing, good time to PREPARE Autumn: Getting colder, food disappearing, LAST CHANCE to prepare Winter: Cold, no food growing, too late to prepare—you need what you stored! Spring: Warm again, new food growing, fresh start! Question: What season is it NOW? What should you be preparing for? | CAUSE (Choice) | EFFECT (Result) | |----------------|-----------------| | Ant worked all summer | Ant has food in winter | | Grasshopper played all summer | Grasshopper has NO food in winter | | Grasshopper didn't plan | Grasshopper is hungry and cold | | Ant planned ahead | Ant is warm and fed | Big Lesson: Your CHOICES have CONSEQUENCES! - Summer Scene: Ant works (lift, lift!), Grasshopper plays (hop, hop!) - Autumn Scene: Ant still working, Grasshopper still playing - Winter Scene: Snow! Cold! Grasshopper is hungry! - Ant's Nest: Grasshopper knocks, asks for food - Ending: Ant has food, Grasshopper learned a lesson Take turns being each character! | ANT | GRASSHOPPER | |-----|-------------| | Hard-working | Lazy | | Plans ahead | Doesn't plan | | Thinks about future | Lives in the moment | | Prepared | Unprepared | | Has food in winter | Hungry in winter | Question: Which character are YOU more like? Which do you WANT to be like? Ant Approach: - Do homework right after school - Finish chores before playing - Study for tests ahead of time - Result: Prepared, less stress, more free time later! Grasshopper Approach: - Put off homework until bedtime - Avoid chores - Wait until last minute to study - Result: Stressed, rushing, no time for fun! Which is better? - Little Red Hen: She worked, others didn't—consequences! - Three Little Pigs: Big pig worked hard on brick house, other pigs didn't—consequences! - Ant & Grasshopper: Ant worked, grasshopper didn't—consequences! - Pattern: HARD WORK = GOOD RESULTS! Billy the Goat says: \"Learning to read is like the ant's work! You practice a LITTLE BIT every day (plant those reading seeds!), and by the END of the year, you can read ANYTHING (you have plenty of 'food' stored up!). Don't be like the grasshopper and say 'I'll practice later!' Practice NOW, read LATER!\" Also: This story is FULL of blends! Grasshopper, plant, store, frost, spring! When you practice blends NOW, reading gets easier LATER! 1. BLEND OVERLOAD: Almost every sentence has initial or final blends! 2. Clear lesson: Planning ahead, consequences 3. Seasonal structure: Summer → Autumn → Winter (time passing) 4. Character contrast: Ant vs. Grasshopper (easy to compare) 5. Relatable: Kids understand work vs. play 6. Short: Can be read in one sitting - Science: Seasons, weather, how animals prepare for winter - Math: Planning, storing (addition—adding food to the nest) - Social Studies: Work ethic, community, self-sufficiency - Character Education: Responsibility, planning, hard work - SEL: Delayed gratification, consequences of choices - grasshopper (insect that hops) - ant (tiny insect that works in colonies) - store (save for later) - plant (put seeds in the ground) - winter (cold season) - summer (warm season) - plan (think ahead and prepare) - frost (ice crystals on grass when it's cold) Story Source: Public Domain (Aesop's Fable) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 24-26 Focus Skills: Initial & final blends (TONS!), seasons, planning ahead, work ethic, cause & effect Story Type: Fable (teaches a lesson) Perfect for: Teaching responsibility and the value of hard work and planning!",
      "emoji": ""
    }
  ]
}