{
  "coverTitle": "The Boy Who Cried Wolf",
  "coverAuthor": "A Beginning Reader for Lessons 28-33",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "There was a small boy who lived on a hill. His job was to watch the sheep. All day long, he sat in the green grass and watched the sheep munch and munch. Munch, munch, munch.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The boy got bored. \"This job is not fun!\" said the boy. \"I wish something would happen!\" Then the boy had an idea. A bad idea. A trick.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The boy ran down the hill. \"WOLF! WOLF!\" he cried. \"A wolf is after the sheep!\" \"Help! Help!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The people in the town ran up the hill. Fast, fast, fast! \"Where is the wolf?\" they said. \"We will help you!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "But there was NO wolf. The sheep were safe in the grass. Munch, munch, munch. The boy laughed and laughed. \"I tricked you!\" said the boy. \"There is no wolf!\" The people were not glad.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The people went back down the hill. \"That was not funny!\" they said. \"Do not trick us again!\" But the boy just laughed.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The next day, the boy got bored again. \"I will do my trick again!\" said the boy. So he ran down the hill. \"WOLF! WOLF!\" he cried. \"A wolf is after the sheep!\" \"Help! Help!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The people ran up the hill again. Fast, fast, fast! \"Where is the wolf?\" they said. But again, there was NO wolf. The sheep were safe. Munch, munch, munch.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The boy laughed and laughed. \"I tricked you again!\" said the boy. The people were mad. \"You lied to us!\" they said. \"We will not trust you now!\" And they went back down the hill.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The next day, something bad happened. A real wolf came! A big, gray wolf with sharp teeth! The wolf crept toward the sheep!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The boy saw the wolf. \"WOLF! WOLF!\" he cried. \"A wolf is after the sheep!\" \"Help! Help!\" \"This time it is real!\" But...",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The people in the town heard the boy. But they did not come. \"He is just tricking us again,\" they said. \"We will not go up the hill.\" And they stayed in the town.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The wolf came closer and closer. The boy had to chase the wolf away all by himself! He ran and yelled and clapped! The wolf ran off. But the boy lost three sheep. He was very sad.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The boy went down the hill. \"I am so sorry!\" said the boy. \"I lied to you. I tricked you. And now you do not trust me.\" \"When I needed help, no one came.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The people said, \"When you lie, people will not trust you. Even when you tell the truth, they will not believe you.\" The boy never lied again. The end. CR blends: cried, crept GR blends: green, grass, gray SH digraph: sheep, sharp TR blends: trick, tricked, trust, truth FL blends: flock BL blends: bleieve The word WOLF: Practice the /wl/ blend sound at the start! Practice Sentence: \"The boy cried 'Wolf!' and tricked the people on the green hill.\" -ST blends: just, last, trust, fast, lost -FT blends: left -ND blends: and -LP blends: help Practice Sentence: \"The people ran fast up the hill to help, but they were just being tricked.\" \"WOLF! WOLF!\" \"Help! Help!\" \"Munch, munch, munch.\" \"Fast, fast, fast!\" \"There is NO wolf!\" 1. What was the boy's job? 2. Why did the boy shout \"Wolf! Wolf!\" the first time? 3. What happened when the people ran up the hill? 4. How many times did the boy trick the people? 5. What happened when a REAL wolf came? 6. Why didn't the people come to help the third time? 7. How did the boy feel at the end? 8. What is the lesson of this story? 9. Was the boy's trick funny? Why or why not? 10. How do you think the people felt when they found out it was a trick? 11. Have you ever told a lie? What happened? 12. Why is it important to tell the truth? 13. What would YOU do if you were bored watching sheep? 14. Can the boy earn back the people's trust? How? Make a chart showing what happened: | CAUSE (What the boy did) | EFFECT (What happened) | |--------------------------|------------------------| | The boy cried \"Wolf!\" (lie #1) | People came to help | | The boy laughed and said \"I tricked you!\" | People were not glad | | The boy cried \"Wolf!\" again (lie #2) | People came again | | The boy laughed again | People got mad, said they wouldn't trust him | | A REAL wolf came | The boy cried for help | | The people heard him cry | They did NOT come (thought it was another trick) | | No one helped | The boy lost three sheep | Question: What was the BIGGEST consequence of lying? How did the boy FEEL at each part of the story? - **Beginning:** Bored \ude11 - After first trick: Happy, thought it was funny 😄 - After second trick: Still laughing 😆 - When real wolf came: Scared! 😱 - When no one came to help: Sad, sorry 😢 Question: When did his feelings change? Why? - What does \"trust\" mean? - How do you earn someone's trust? - How do you LOSE someone's trust? - Is it easy or hard to get trust back after you lose it? - Who do you trust? Why? - Be the boy: Shout \"WOLF! WOLF! HELP! HELP!\" - Be the people: Run up the hill! (run in place) - Be the sheep: Munch, munch, munch! (pretend to eat grass) - Be the wolf: Creep slowly toward the sheep (sneak walk) Take turns being each character! What if the boy had NOT lied the first two times? What would happen when the real wolf came? Write or draw a different ending! This is a fable — a story that teaches a lesson. The lesson: When you lie, people will not trust you. Even when you tell the truth, they might not believe you. Other ways to say it: - \"Honesty is the best policy\" - \"If you lie, people won't believe you when you tell the truth\" - \"Trust is hard to earn and easy to lose\" Question: How can you be an honest person? - Three Billy Goats Gruff: The troll tried to trick the goats, but the BIG goat stopped him. The boy tried to trick the people, and he got in trouble. - Three Little Pigs: The pigs who worked hard (big pig) had good consequences. The boy who lied had bad consequences. - Connection: Your CHOICES have CONSEQUENCES! Billy the Goat teaches honesty on the reading mountain! When you make a mistake, you admit it and try harder next time. You don't trick your teacher or parent by pretending to read when you're guessing. Billy says: Be honest, work hard, and people will trust you! Also: The boy's job was to watch SHEEP (animals). Billy is a GOAT (also an animal). What other animal jobs can you think of? 1. Blends practice: wolf, cried, sheep, tricks, trust, help, fast, just, last 2. Short & punchy: Great for maintaining attention 3. Clear moral: Easy to discuss consequences 4. Repetitive structure: \"Wolf! Wolf! Help! Help!\" gives kids confidence 5. Cause & effect: Every action has a consequence (perfect for comprehension skill) 6. Character motivation: WHY did the boy lie? (boredom → bad choice) 7. Real-world application: Honesty matters in daily life - Social Studies: Community helpers (people in the town helped each other) - Character Education: Honesty, trustworthiness, consequences of lying - SEL (Social-Emotional Learning): Understanding how our actions affect others - lie (tell something that's not true) - trust (believe someone will tell the truth) - trick (fool someone) - consequence (what happens because of your choice) - fable (a short story with a lesson/moral) - moral (the lesson the story teaches) Story Source: Public Domain (Aesop's Fable) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 28-33 Focus Skills: Blends (especially \"wolf\"), cause & effect, character consequences, honesty, story moral, predictions Story Type: Fable (teaches a lesson)",
      "emoji": "\ud83d"
    }
  ]
}