{
  "coverTitle": "The Brave Little Tailor",
  "coverAuthor": "A Beginning Reader for Lessons 40-42",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "Page 1",
      "text": "Once upon a day, there lived a little tailor. He made clothes. He sat and sewed all day long. One day, he made some jam. He put it on bread. But flies came! Seven flies landed on his jam!",
      "emoji": ""
    },
    {
      "title": "Page 2",
      "text": "\"Go away, flies!\" said the tailor. He was mad. He grabbed a cloth. SMACK! He hit all seven flies at once! They all fell down. \"Seven at one blow!\" he cried. \"I am brave!\"",
      "emoji": ""
    },
    {
      "title": "Page 3",
      "text": "The tailor made a belt. On it, he wrote: \"SEVEN AT ONE BLOW!\" He put on the belt. He felt very brave. \"I will go out into the world!\" he said. \"I will show everyone how brave I am!\" And off he went.",
      "emoji": ""
    },
    {
      "title": "Page 4",
      "text": "As the tailor walked, he came to a big hill. A giant sat on top! The giant saw the belt. It said, \"SEVEN AT ONE BLOW!\" \"Wow!\" said the giant. \"You must be very strong! Did you defeat seven men at one blow?\" The tailor just smiled. He did not say he meant flies!",
      "emoji": ""
    },
    {
      "title": "Page 5",
      "text": "\"Let me test you,\" said the giant. He picked up a rock. He squeezed it. Water dripped out! \"Can you do that?\" asked the giant. The tailor thought fast. He had some cheese in his pack. He pulled it out and squeezed. Whey dripped out! \"Of course I can!\" said the tailor.",
      "emoji": ""
    },
    {
      "title": "Page 6",
      "text": "The giant was amazed. \"Okay, let's see you throw,\" he said. The giant threw a rock. It flew far, then fell. The tailor had a little bird in his pack. He threw the bird up into the sky! The bird flew away and did not come back! \"Mine did not fall!\" said the tailor. \"It flew away!\"",
      "emoji": ""
    },
    {
      "title": "Page 7",
      "text": "The giant was impressed. \"Come stay with me!\" he said. That night, the tailor slept in the giant's cave. But the bed was too big! So the tailor slept in the corner instead. The giant tried to smash the bed in the night! But the tailor was safe in the corner!",
      "emoji": ""
    },
    {
      "title": "Page 8",
      "text": "In the morning, the giant ran away. He thought the tailor was too strong to defeat! The tailor kept walking. He came to a castle. The king saw his belt: \"SEVEN AT ONE BLOW!\" \"You are very brave!\" said the king. \"Will you help me? A dragon is in the woods. It will not go away.\"",
      "emoji": ""
    },
    {
      "title": "Page 9",
      "text": "The tailor agreed. He went into the woods. He found the dragon. It was huge! But it was asleep and snoring. The tailor climbed a tree. He dropped pebbles on the dragon's nose. The dragon woke up! It thought another dragon hit it!",
      "emoji": ""
    },
    {
      "title": "Page 10",
      "text": "The dragon roared! It looked around. It saw its own shadow and thought it was another dragon! The two \"dragons\" (really just one confused dragon!) fought. The dragon chased its own tail! It got so dizzy, it ran away into the hills! The tailor climbed down. \"The dragon is gone!\" he called.",
      "emoji": ""
    },
    {
      "title": "Page 11",
      "text": "The king was amazed! \"You are the bravest man I know!\" he said. \"You may marry my daughter and live in the castle!\" And so the little tailor became a prince! He lived happily ever after. All because he was clever and brave!",
      "emoji": ""
    },
    {
      "title": "Page 12",
      "text": "\"SEVEN AT ONE BLOW!\" And that is the story of the brave little tailor who defeated seven flies, tricked a giant, and chased away a dragon—all with cleverness and courage! AI/AY Vowel Team Words from the Story: brave, tailor, wait, may, day, say, away, stay, tail, pain, grain, rain, chain Magic E Review: made, came, name, safe, smack, smoke Other Decodable Words: flies, jam, hit, fell, belt, show, rock, hill, test, pack \"Seven at one blow!\" | \"Go away!\" | \"I am brave!\" 1. What did the tailor hit? (Seven flies!) 2. What did the giant think the tailor defeated? (Seven men!) 3. How did the tailor trick the giant with the rock? (He squeezed cheese instead!) 4. How did he trick the giant with throwing? (He threw a bird, not a rock!) 5. How did he defeat the dragon? (He made it fight itself!) 6. What makes the tailor clever? (He uses his brain to solve problems!) - AI/AY Hunt: Find all the AI and AY words. Make two lists! - Act It Out: Act out the tailor squeezing cheese and throwing the bird! - Draw & Write: Draw the tailor's belt with \"Seven at one blow!\" on it. - Billy's Connection: Billy the Goat is clever like the tailor! He uses his brain to solve mountain problems. You can be clever too! Theme: Intelligence and quick thinking can be more powerful than strength. The little tailor wasn't strong, but he was smart! You don't have to be the biggest to be the bravest! Story Source: Brothers Grimm Fairy Tale (Public Domain) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 40-42 **Mountain Connection:** Billy says, \"Brains beat brawn! Stay clever, stay safe!\" \udc10⛰️💡",
      "emoji": "\ud83d"
    }
  ]
}