{
  "coverTitle": "The Town Musicians of Bremen (Extended)",
  "coverAuthor": "A Beginning Reader for Lessons 64-65",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "Once there was a donkey. He was old and tired. His owner did not want him anymore. \"You are no good!\" said the man. The donkey was sad. \"I will run away,\" he said. \"I will go to Bremen and become a musician!\" So the donkey set off down the road.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "As the donkey walked, he saw a dog lying by a hedge. The dog looked tired and sad. \"What is wrong?\" asked the donkey. \"I am old,\" said the dog. \"My owner says I cannot catch rabbits anymore. He does not want me.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Come with me to Bremen!\" said the donkey. \"We will be musicians!\" \"I knew you would help me!\" said the dog happily. \"Let's go!\" So the donkey and the dog walked down the road together.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Soon they came to a bridge. A cat sat on the ledge, crying. \"What is wrong?\" asked the donkey. \"I am old,\" said the cat. \"I cannot catch mice anymore. My owner does not want me.\" \"Come with us to Bremen!\" said the dog. \"We will be musicians!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The cat smiled. \"That sounds wonderful!\" she said. So the donkey, the dog, and the cat walked down the road together. They knew they would make a great team!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "As the sun began to set, they saw a rooster sitting on a fence. He was crowing loudly. \"Cock-a-doodle-doo!\" \"What is wrong?\" asked the donkey. \"Tomorrow my owner plans to cook me for dinner!\" cried the rooster. \"I must run away tonight!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Come with us to Bremen!\" said the cat. \"We are going to be musicians!\" \"I will!\" said the rooster. \"Let's go!\" So the donkey, the dog, the cat, and the rooster walked down the road together. Four friends on an adventure!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Night fell. The animals were tired and hungry. They saw a light in the distance. \"Let's go see!\" said the donkey. \"Maybe we can rest there.\" They walked to the edge of the forest. They saw a little cottage! Light glowed from the window.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The donkey looked in the window. Inside were robbers! They sat around a table piled with food! The robbers were counting stolen gold and jewels! \"We must catch them!\" whispered the dog. \"They are thieves!\" \"But how?\" asked the cat. \"There are four of them!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The donkey had an idea. \"Let's match our voices together! We will make such a loud noise, they will run away!\" \"Good plan!\" said the dog. The donkey stood under the window. The dog stood on the donkey's back. The cat climbed onto the dog. The rooster perched on top of the cat.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Then, all together, they made music! The donkey: \"HEE-HAW!\" The dog: \"WOOF-WOOF!\" The cat: \"MEOW!\" The rooster: \"COCK-A-DOODLE-DOO!\" The sound was LOUD! VERY loud!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The robbers jumped up! \"What is that terrible noise?!\" they cried. They looked at the window. They saw a strange creature with four heads! \"A monster!\" they screamed. \"Run!\" The robbers ran out the door and into the forest! They knew they had to get away!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The four friends tumbled through the window. They landed in a patch on the floor! They looked around. Food! A warm fire! Soft beds! \"This is perfect!\" said the donkey. \"Let's stay here!\" They ate the food. They rested by the fire. They felt safe and happy.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Later that night, one brave robber came back. He wanted to fetch his gold. He crept to the door. He tried to knock quietly. Suddenly, the animals woke up!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The cat jumped on the robber's face! She scratched him! The dog bit his leg! The donkey kicked him with his back hooves! The rooster crowed in his ear! \"COCK-A-DOODLE-DOO!\" The robber ran away as fast as he could! He never came back!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The four friends lived in the cottage happily ever after. They never made it to Bremen. But that was okay! They had each other. They had a home. And every night, they made music together under the stars. THE END TCH Words: catch, watch, fetch, match, patch, stretch, scratch, witch, kitchen, latch DGE Words: bridge, ledge, hedge, edge, badge, judge, fudge, budge, smudge, ridge Silent Letter Words (KN, WR): knew, knee, knock, knot, know, knife, write, wrong, wrap, wrist Other Decodable Words: donkey, dog, cat, rooster, road, run, sad, old, tired, home, robbers, safe, brave \"What is wrong?\" | \"Come with us!\" | \"Knew they would!\" | \"Catch them!\" 1. Which four animals became friends? (Donkey, dog, cat, rooster) 2. Where were they going? (To Bremen to be musicians!) 3. What did they find in the forest? (A cottage with robbers inside!) 4. How did they scare the robbers? (They stood on each other and made loud music!) 5. Did they make it to Bremen? (No, they stayed in the cottage!) 6. What is the lesson? (Friends working together can solve any problem!) - TCH/DGE Hunt: Find all the TCH and DGE words. Notice they come after short vowels! - Silent Letter Detective: Find KN and WR words. Circle the silent letters! - Act It Out: Stack up like the animals! Make their sounds together! - Draw & Write: Draw all four animals stacked on top of each other! - Billy's Connection: Billy the Goat knows that friends help each other! When goats work together, they can climb anything! Theme: Teamwork and loyalty. Four old, unwanted animals found friendship and courage together. They helped each other and became a family. You're stronger when you work together! Discussion: Have you ever worked with friends to solve a problem? Story Source: Brothers Grimm Folktale (Public Domain) BedrockELA Adaptation: February 2026 (Extended Version) For use with: BedrockELA 1st Grade Curriculum, Lessons 64-65 **Mountain Connection:** Billy says, \"Together we climb! Together we thrive!\" \udc10⛰️🎵",
      "emoji": "\ud83d"
    }
  ]
}