{
  "coverTitle": "The Enormous Turnip",
  "coverAuthor": "A Beginning Reader for Lessons 1-5",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "A man had a garden. He planted a turnip seed. \"Grow, turnip, grow!\" said the man. And it did! It grew and grew and grew!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The turnip grew ENORMOUS! It was as big as a tub! It was as big as a bag! It was ENORMOUS!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The man wanted the turnip. He grabbed the turnip. Pull! Pull! Pull! But the turnip did not come up.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The man called his wife. \"Come help me!\" said the man. The wife grabbed the man. The man grabbed the turnip. Pull! Pull! Pull! But the turnip did not come up.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The wife called the son. \"Come help us!\" said the wife. The son grabbed the wife. The wife grabbed the man. The man grabbed the turnip. Pull! Pull! Pull! But the turnip did not come up.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The son called the dog. \"Come help us!\" said the son. The dog grabbed the son. The son grabbed the wife. The wife grabbed the man. The man grabbed the turnip. Pull! Pull! Pull! But the turnip did not come up.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The dog called the cat. \"Come help us!\" said the dog. The cat grabbed the dog. The dog grabbed the son. The son grabbed the wife. The wife grabbed the man. The man grabbed the turnip. Pull! Pull! Pull! But the turnip did not come up.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The cat called the mouse. \"Come help us!\" said the cat. The tiny mouse said, \"I will help!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The mouse grabbed the cat. The cat grabbed the dog. The dog grabbed the son. The son grabbed the wife. The wife grabbed the man. The man grabbed the turnip. Pull! Pull! Pull!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "POP! Up came the turnip! BOOM! They all fell down!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"We did it!\" said the man. \"We did it!\" said the wife. \"We did it!\" said the son. \"We did it!\" said the dog. \"We did it!\" said the cat. \"We did it!\" said the mouse.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "They had turnip soup. They had turnip jam. They had turnip pie. Yum, yum, yum! And they all said, \"Teamwork is the best!\" The end! M words: man, mouse, mom, mat, mop S words: son, sat, sap, sit P words: pop, pat, pan, pin A words: am, an, at N words: nap, not, net T words: top, tan, tap, tub B words: big, bag, bat J words: jam, jab, jot Practice Sentence: \"The man and the mouse sat on a mat.\" \"Pull! Pull! Pull!\" \"But the turnip did not come up.\" \"Come help us!\" \"We did it!\" \"Yum, yum, yum!\" 1. What did the man plant? 2. How big did the turnip grow? 3. Who came to help FIRST? (wife) 4. Who came LAST? (mouse) 5. Who was the biggest helper? Who was the smallest? 6. Did the mouse matter even though he was small? 7. What does \"teamwork\" mean? Put the helpers in order! Use toys or draw pictures: 1. Man 2. Wife 3. Son 4. Dog 5. Cat 6. Mouse (smallest but IMPORTANT!) - Line up family members or stuffed animals - Pretend to pull an enormous turnip! - Everyone say \"Pull! Pull! Pull!\" together - Fall down when it pops up! BOOM! - Find toys: biggest → smallest - Talk about: enormous, big, small, tiny - The mouse was TINY but still helped! - What is teamwork? - Have you ever worked with a team? - Why is teamwork important? - Even small people can help in BIG ways! - Pretend to make soup together - What would you put in it? - Practice cooking vocabulary (stir, chop, pour, taste) Billy the Goat says: \"Even the smallest goat can climb a big mountain if everyone works together!\" Just like the tiny mouse helped pull up the enormous turnip, even beginning readers can tackle big stories with help from teachers, parents, and friends! Story Source: Public Domain (Russian Folk Tale) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 1-5 Focus Skills: First letter sounds (m,s,p,a,n,t,b,j), teamwork, sequence, size concepts Perfect for: Very first readers! Builds confidence through repetition and participation.",
      "emoji": ""
    }
  ]
}