{
  "coverTitle": "The Gingerbread Man",
  "coverAuthor": "A Beginning Reader for Lessons 6-10",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "A little old woman lived in a little old house. One day, she made a gingerbread man. She gave him raisin eyes. She gave him a red candy mouth. She gave him candy buttons. \"Perfect!\" said the woman.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "She put the gingerbread man in the hot oven. \"Sit in there and bake!\" she said. The gingerbread man got hot. He got crisp. He got done.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The woman opened the oven lid. POP! The gingerbread man hopped out! He ran to the door! \"Come back!\" said the woman. But the gingerbread man did not stop!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The gingerbread man ran and ran! He yelled, \"**Run, run, as fast as you can! You can't catch me, I'm the Gingerbread Man!**\" And off he went!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The gingerbread man saw a cow. \"Stop!\" said the cow. \"I want to eat you!\" But the gingerbread man said, \"**Run, run, as fast as you can! You can't catch me, I'm the Gingerbread Man!**\" And he ran faster!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The gingerbread man saw a dog. \"Stop!\" said the dog. \"I want to eat you!\" But the gingerbread man said, \"**Run, run, as fast as you can! You can't catch me, I'm the Gingerbread Man!**\" And he ran faster!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The gingerbread man saw a pig. \"Stop!\" said the pig. \"I want to eat you!\" But the gingerbread man said, \"**Run, run, as fast as you can! You can't catch me, I'm the Gingerbread Man!**\" And he ran faster!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The gingerbread man saw a cat. \"Stop!\" said the cat. \"I want to eat you!\" But the gingerbread man said, \"**Run, run, as fast as you can! You can't catch me, I'm the Gingerbread Man!**\" And he ran faster!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The gingerbread man came to a river. \"Oh no!\" said the gingerbread man. \"I cannot swim! But I cannot stop!\" The cow, the dog, the pig, and the cat were running after him!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "A fox came by. \"I can help you!\" said the fox. \"Hop on my tail. I will take you across!\" The gingerbread man hopped on the fox's tail.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The fox went into the river. \"Hop on my back!\" said the fox. \"My tail is getting wet!\" The gingerbread man hopped on the fox's back.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Hop on my head!\" said the fox. \"My back is getting wet!\" The gingerbread man hopped on the fox's head. \"Hop on my nose!\" said the fox. \"My head is getting wet!\" The gingerbread man hopped on the fox's nose.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The fox opened his mouth wide. SNAP! He ate the gingerbread man in one bite! \"Yum!\" said the fox. And that was the end of the gingerbread man! The end! G words: got, go, give, gingerbread D words: done, door, dog, did C words: can, cow, cat, catch, come Y words: you, yell, yum H words: hot, hop, house, head, help K words: (silent in can't, but practice /k/ sound) R words: ran, run, red, river, raisin I words: in, it, is V words: oven F words: fast, fox, fin O words: on, open, off, old L words: little, lid, leg W words: woman, wet, wide Practice Sentence: \"The dog and the cat ran as fast as they can!\" \"**Run, run, as fast as you can! You can't catch me, I'm the Gingerbread Man!**\" \"Stop! I want to eat you!\" \"Hop on my _____!\" \"Yum!\" 1. Who made the gingerbread man? 2. What happened when the oven opened? 3. Who chased the gingerbread man? (cow, dog, pig, cat) 4. Who helped the gingerbread man cross the river? 5. Was the fox really helping? Or was he tricky? 6. What happened at the end? 7. Do you think the gingerbread man should have trusted the fox? Who chased first? Who chased last? 1. Cow 2. Dog 3. Pig 4. Cat 5. Fox (didn't chase—he was CLEVER!) - One person is the gingerbread man - Everyone else is the animals chasing - RUN around the room! - Shout \"Run, run, as fast as you can!\" - Fall down laughing at the end! - The fox SAID he would help - But he ATE the gingerbread man! - He was TRICKY / CLEVER / SLY - Can someone seem nice but not be nice? - Don't trust strangers! - CAUSE: Woman opened the oven → EFFECT: Gingerbread man ran away - CAUSE: Animals chased him → EFFECT: He ran to the river - CAUSE: He couldn't swim → EFFECT: He asked fox for help - CAUSE: He hopped on the fox's nose → EFFECT: Fox ate him! SNAP! - Draw a gingerbread man - Add raisin eyes, candy mouth, candy buttons - Give him a name! - Where would YOUR gingerbread man run? - Cow: MOOOO! - Dog: WOOF! WOOF! - Pig: OINK! OINK! - Cat: MEOW! - Fox: (Foxes say... what do YOU think?) Billy the Goat says: \"Don't run away from your lessons! The gingerbread man ran away and got into trouble. But when you RUN TOWARD your reading practice (not away!), you get BETTER, not EATEN!\" Also: The gingerbread man was fast, but the clever fox was SMARTER. In reading, being CLEVER (thinking about what you read) is better than being FAST! Story Source: Public Domain (English/American Folk Tale) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 6-10 Focus Skills: All basic consonants & vowels, action/movement, character traits (clever/tricky), cause & effect Perfect for: Energetic readers who love chasing and action! Gets the wiggles out!",
      "emoji": ""
    }
  ]
}