{
  "coverTitle": "Goldilocks and the Three Bears (Extended)",
  "coverAuthor": "A Beginning Reader for Lessons 59-60",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "Page 1",
      "text": "Once upon a time, in a wood, there were three bears. Papa Bear was big. Mama Bear was medium. Baby Bear was small. They lived in a good little house in the woods. One morning, Mama Bear made porridge for breakfast. It was hot! Too hot to eat!",
      "emoji": ""
    },
    {
      "title": "Page 2",
      "text": "\"Let's go for a walk in the wood while it cools,\" said Mama Bear. \"Good idea!\" said Papa Bear. The three bears walked out the door. They left it open to let cool air in. Soon they were walking among the trees, enjoying the morning.",
      "emoji": ""
    },
    {
      "title": "Page 3",
      "text": "A little girl named Goldilocks was walking in the wood that morning too. She had golden hair that shone in the sun. Goldilocks saw the bears' house. She looked in the window. \"A house in the woods!\" she said. \"I wonder who lives here?\"",
      "emoji": ""
    },
    {
      "title": "Page 4",
      "text": "Goldilocks knocked on the door. Knock, knock! No one answered. She pushed the door open and stepped inside. \"Hello?\" she called. \"Anyone home?\" The room was quiet. No one was there.",
      "emoji": ""
    },
    {
      "title": "Page 5",
      "text": "Goldilocks looked around the room. She saw three bowls of porridge on the table. One big bowl. One medium bowl. One small bowl. \"Mmm, food!\" said Goldilocks. \"I am hungry!\" She took a spoon and tasted the porridge in the big bowl. \"Yuck! Too hot!\" she said.",
      "emoji": ""
    },
    {
      "title": "Page 6",
      "text": "Goldilocks tasted the porridge in the medium bowl. \"Yuck! Too cold!\" she said. Then she tasted the porridge in the small bowl. \"Mmm! This one is just right!\" she said. She ate it all up! Soon the small bowl was empty!",
      "emoji": ""
    },
    {
      "title": "Page 7",
      "text": "Goldilocks looked around the room some more. She saw three chairs. One big chair. One medium chair. One small chair. \"I am tired,\" said Goldilocks. \"I will sit down.\" She sat in the big chair. \"Too hard!\" she said.",
      "emoji": ""
    },
    {
      "title": "Page 8",
      "text": "Goldilocks sat in the medium chair. \"Too soft!\" she said. Then she sat in the small chair. \"This one is just right!\" she said happily. But then—CRACK! The chair broke! Goldilocks fell to the floor! \"Oops!\" she said.",
      "emoji": ""
    },
    {
      "title": "Page 9",
      "text": "Goldilocks stood up. She shook herself off. She looked around. She saw stairs. \"I wonder what is up there?\" she thought. She climbed the stairs. At the top, she found a bedroom with three beds! One big bed. One medium bed. One small bed.",
      "emoji": ""
    },
    {
      "title": "Page 10",
      "text": "Goldilocks was very tired now. She lay down on the big bed. \"Too hard!\" she said. She lay down on the medium bed. \"Too soft!\" she said. Then she lay down on the small bed. \"This one is just right!\" she said. And soon, Goldilocks was fast asleep!",
      "emoji": ""
    },
    {
      "title": "Page 11",
      "text": "Meanwhile, the three bears came home from their walk. They walked into the room. Papa Bear looked at his bowl. \"Someone has been eating my porridge!\" he said in his big, deep voice. Mama Bear looked at her bowl. \"Someone has been eating my porridge!\" she said in her medium voice. Baby Bear looked at his bowl. \"Someone has been eating my porridge, and they ate it all up!\" he cried in his small voice.",
      "emoji": ""
    },
    {
      "title": "Page 12",
      "text": "Then Papa Bear looked at his chair. \"Someone has been sitting in my chair!\" he said. Mama Bear looked at her chair. \"Someone has been sitting in my chair!\" she said. Baby Bear looked at his chair. \"Someone has been sitting in my chair, and they broke it!\" he cried.",
      "emoji": ""
    },
    {
      "title": "Page 13",
      "text": "The three bears climbed the stairs. They went into the bedroom. Papa Bear looked at his bed. \"Someone has been sleeping in my bed!\" he said. Mama Bear looked at her bed. \"Someone has been sleeping in my bed!\" she said. Baby Bear looked at his bed. \"Someone has been sleeping in my bed, and there she is!\" he cried.",
      "emoji": ""
    },
    {
      "title": "Page 14",
      "text": "Goldilocks woke up! She saw three bears looking at her! \"Oh no!\" she cried. She jumped out of bed! She ran down the stairs! She ran out the door! She ran and ran through the wood until she was far, far away! And she never came back.",
      "emoji": ""
    },
    {
      "title": "Page 15",
      "text": "The three bears shook their heads. \"What a strange morning!\" said Mama Bear. \"I hope she learned not to go into someone else's house without asking!\" said Papa Bear. \"I hope so too!\" said Baby Bear. And they sat down to make more porridge and fix Baby Bear's chair. THE END OO Words (short sound like \"book\"): good, wood, look, book, took, shook, cook, hook, stood, foot OO Words (long sound like \"moon\"): food, moon, soon, spoon, room, cool, too, zoo, broom, noon, pool, stool Other Decodable Words: bears, house, hot, walk, door, girl, bowl, ate, chair, sat, fell, bed, sleep, ran, home \"Too hot! Too cold! Just right!\" | \"Someone has been...\" | \"In the wood\" 1. Where did the three bears live? (In a house in the wood) 2. Why did they go for a walk? (The porridge was too hot—they wanted it to cool) 3. What did Goldilocks do in their house? (She ate their food, sat in their chairs, slept in their beds!) 4. What happened to Baby Bear's chair? (Goldilocks broke it!) 5. What did Goldilocks do when the bears came home? (She ran away!) 6. What is the lesson? (Don't go into someone else's home without permission!) - OO Hunt: Find all the OO words. Sort them: Does OO sound like \"book\" or \"moon\"? - Act It Out: Use three different voices for the bears! Act out Goldilocks tasting, sitting, and sleeping! - Draw & Write: Draw the three bears and the three bowls of porridge! - Billy's Connection: Billy the Goat would never go into someone else's cave without asking! Always respect others' space! Theme: Respect others' property. Goldilocks went into the bears' house without permission. She ate their food and broke their chair! That's not polite! Always ask before touching or using things that aren't yours. Discussion: How would you feel if someone came into your house and used your things without asking? Story Source: English Fairy Tale (Public Domain) BedrockELA Adaptation: February 2026 (Extended Version) For use with: BedrockELA 1st Grade Curriculum, Lessons 59-60 **Mountain Connection:** Billy says, \"Always knock and wait! Respect others' homes!\" \udc10⛰️🐻",
      "emoji": "\ud83d"
    }
  ]
}