{
  "coverTitle": "Goldilocks and the Three Bears",
  "coverAuthor": "A Beginning Reader for Lessons 21-33",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "Deep in the green grass and tall trees, there lived three bears. A big Papa Bear with brown fur. A smaller Mama Bear with brown fur. And a wee Baby Bear with soft brown fur.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "One day, Mama Bear made fresh oats for breakfast. \"The oats are too hot!\" said Papa Bear. \"Let's take a walk in the woods.\" So all three bears left the den. Off they went into the green woods! Stomp, stomp, stomp!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "A little girl was lost in the woods. Her name was Goldilocks. She had long, blond hair, as bright as gold. \"I am so tired!\" said Goldilocks. \"I wish I could rest!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Goldilocks saw the bears' den. Knock, knock, knock. No one came. \"I will go in,\" said Goldilocks. And in she went.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Goldilocks saw three bowls of oats. A big bowl. A smaller bowl. A wee small bowl. \"I am so hungry!\" said Goldilocks.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Goldilocks tried the big bowl. \"This is TOO HOT!\" she said. Then she tried the smaller bowl. \"This is TOO COLD!\" she said. Then she tried the wee small bowl. \"This is JUST RIGHT!\" And she ate it all up! Yum, yum, yum!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Goldilocks saw three chairs. A big chair. A smaller chair. A wee small chair. \"I am so tired!\" said Goldilocks.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Goldilocks sat in the big chair. \"This is TOO HARD!\" she said. Then she sat in the smaller chair. \"This is TOO SOFT!\" she said. Then she sat in the wee small chair. \"This is JUST RIGHT!\" But CRACK! The chair broke! Crash! Goldilocks fell down!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Goldilocks went up the steps. Creak, creak, creak. She saw three beds. A big bed. A smaller bed. A wee small bed. \"I am so tired!\" said Goldilocks.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Goldilocks tried the big bed. \"This is TOO HARD!\" she said. Then she tried the smaller bed. \"This is TOO SOFT!\" she said. Then she tried the wee small bed. \"This is JUST RIGHT!\" And she fell fast asleep. Zzzzz...",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The three bears came back from their walk. Stomp, stomp, stomp! Papa Bear looked at his bowl. \"Someone has been eating my oats!\" said Papa Bear in his big, gruff voice.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Mama Bear looked at her bowl. \"Someone has been eating my oats!\" said Mama Bear in her smaller voice. Baby Bear looked at his bowl. \"Someone has been eating my oats!\" said Baby Bear in his wee small voice. \"And they ate it ALL UP!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Papa Bear looked at his chair. \"Someone has been sitting in my chair!\" said Papa Bear in his big, gruff voice. Mama Bear looked at her chair. \"Someone has been sitting in my chair!\" said Mama Bear in her smaller voice. Baby Bear looked at his chair. \"Someone has been sitting in my chair!\" said Baby Bear in his wee small voice. \"And they broke it into bits!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The three bears went up the steps. Creak, creak, creak. Papa Bear looked at his bed. \"Someone has been sleeping in my bed!\" said Papa Bear in his big, gruff voice. Mama Bear looked at her bed. \"Someone has been sleeping in my bed!\" said Mama Bear in her smaller voice.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Baby Bear looked at his bed. \"Someone has been sleeping in my bed!\" said Baby Bear in his wee small voice. \"And she is STILL here!\" All three bears looked at Goldilocks.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Goldilocks woke up! She saw the three bears! \"Oh no!\" said Goldilocks. She jumped out of bed. She ran down the steps. Fast, fast, fast! She ran out the door. She ran and ran and ran! And she did not stop!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Goldilocks ran all the way home. The three bears went back to their breakfast. Papa Bear made fresh oats. Mama Bear fixed the wee small chair. And Baby Bear was glad to rest in his own bed. The end! BL blends: blond, black BR blends: brown, broke, bright, breakfast, bread CR blends: creak, crack, crash FR blends: fresh, from GL blends: glad GR blends: green, grass, gruff SL blends: sleeping TR blends: tried, trees Practice Sentence: \"The three brown bears had fresh breakfast in the green grass.\" -ST blends: fast, just, best, last, rest, lost -FT blends: soft, left -ND blends: and -LT blends: felt -MP blends: jump Practice Sentence: \"Goldilocks left and ran fast down the path and did not rest!\" \"This is TOO BIG!\" \"This is TOO SMALL!\" \"This is JUST RIGHT!\" \"Someone has been eating my oats!\" \"Someone has been sitting in my chair!\" \"Someone has been sleeping in my bed!\" 1. How many bears lived in the den? What size were they? 2. Why did the bears leave their den? 3. Who came into the bears' den? What did she do? 4. What happened to Baby Bear's chair? 5. How did Goldilocks feel when she saw the three bears? 6. Was it OK for Goldilocks to go into the bears' den? Why or why not? 7. What would YOU do if you were Goldilocks? - Initial Blends: Find all the words that START with two letters blending together (brown, black, fresh, glad, green, grass, gruff) - Final Blends: Find all the words that END with two letters blending together (fast, just, best, last, rest, lost, soft, left, felt, and) - Make two lists! - Be Goldilocks! Try three chairs (big pillow, medium pillow, small pillow). Say \"Too hard! Too soft! Just right!\" - Be the three bears! Use three different voices (deep, medium, high) - Act out Goldilocks running away! Run in place! - Draw three bowls, three chairs, three beds - Find three toys in your house — big, medium, small - Practice comparing: bigger, biggest / smaller, smallest / softer, softest - Goldilocks broke Baby Bear's chair. What should she do? - How could Goldilocks have been a better guest? - What would you say to Goldilocks if you met her? - What happened FIRST? (Bears made oats and went for a walk) - What happened NEXT? (Goldilocks came in) - What happened AFTER THAT? (She tried the bowls, chairs, beds) - What happened LAST? (Bears came home, Goldilocks ran away) Billy the Goat teaches kids to try hard things on their reading journey — sometimes the lesson is \"too hard,\" sometimes \"too easy,\" but when it's \"just right,\" you learn the best! Just like Goldilocks found what was \"just right\" for her. Also: Both stories have THREE characters (three goats, three bears). Can you think of other stories with three main characters? - Goldilocks: Curious but didn't make good choices (went into a house without permission, broke things) - Baby Bear: Kind, shares his things even though they get broken/eaten - Three Bears: Fair (they let Goldilocks go, they don't hurt her) - CAUSE: The oats were too hot → EFFECT: The bears went for a walk - CAUSE: Goldilocks sat in the small chair → EFFECT: The chair broke - CAUSE: The bears came home → EFFECT: Goldilocks ran away - Big, bigger, biggest - Small, smaller, smallest - Hard, harder, hardest - Soft, softer, softest - This is perfect for teaching comparatives (Lesson 73 preview!) Story Source: Public Domain (English Fairy Tale) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 21-33 Focus Skills: Initial & final blends, story sequence, predictions, problem/solution, character actions, comparative language",
      "emoji": ""
    }
  ]
}