{
  "coverTitle": "Henny Penny (Chicken Little)",
  "coverAuthor": "A Beginning Reader for Lessons 29-31",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "Henny Penny was a little hen. One day, she sat under a tree. BONK! An acorn fell on her head! \"Ow!\" said Henny Penny.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Henny Penny looked up. \"Oh no!\" she said. \"The sky is falling! I must go tell the king!\" And off she went.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Henny Penny saw Ducky Lucky. \"Where are you going?\" said Ducky Lucky. \"The sky is falling!\" said Henny Penny. \"I will go tell the king!\" \"I will come too!\" said Ducky Lucky. And off they went.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "They saw Goosey Loosey. \"Where are you going?\" said Goosey Loosey. \"The sky is falling!\" said Henny Penny. \"We will go tell the king!\" \"I will come too!\" said Goosey Loosey. And off they went.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "They saw Turkey Lurkey. \"Where are you going?\" said Turkey Lurkey. \"The sky is falling!\" said Henny Penny. \"We will go tell the king!\" \"I will come too!\" said Turkey Lurkey. And off they went.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "They all ran and ran. \"The sky is falling!\" \"The sky is falling!\" \"We must tell the king!\" They yelled and they ran.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "They saw Foxy Loxy. \"Where are you going?\" said Foxy Loxy. \"The sky is falling!\" said Henny Penny. \"We will go tell the king!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Oh my!\" said Foxy Loxy. \"I know a quick way to the king! Follow me!\" \"Yes! Yes!\" said Henny Penny. And they all followed Foxy Loxy.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Foxy Loxy led them to his den. \"This way!\" said Foxy Loxy. But Henny Penny stopped. \"Wait!\" she said. \"This is not the way to the king! This is Foxy Loxy's den!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"The fox will eat us!\" said Henny Penny. \"Run!\" they all yelled. And they ran away from Foxy Loxy! Foxy Loxy was mad. His trick did not work!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Henny Penny and her friends stopped. \"Wait,\" said Ducky Lucky. \"Did the sky really fall?\" \"I... I do not know,\" said Henny Penny. \"What fell on you?\" said Goosey Loosey.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Henny Penny looked at the ground. She saw a small acorn. \"Oh!\" said Henny Penny. \"It was just an acorn! The sky did NOT fall! I was silly!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "All the animals laughed. \"We were all silly!\" said Turkey Lurkey. \"We did not check!\" said Goosey Loosey. \"We just believed it!\" said Ducky Lucky. Henny Penny felt silly.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The lesson: Do not panic! Do not believe everything you hear! Check if it is really true! The end! LL words: Henny, Penny, fell, will, bell, tell, call, all, hill, follow, silly FF words: off SS words: Goosey, Loosey (single s makes /z/ sound here) Double Letter Practice Sentence: \"Henny Penny will tell all the animals to call from the hill!\" \"The sky is falling!\" \"I will go tell the king!\" \"I will come too!\" \"And off they went!\" \"Where are you going?\" 1. What fell on Henny Penny's head? (an acorn) 2. What did Henny Penny THINK fell? (the sky!) 3. Who did she tell? (Ducky Lucky, Goosey Loosey, Turkey Lurkey) 4. Did they check if it was true? (NO! They just believed her!) 5. Who tried to trick them? (Foxy Loxy) 6. What was the fox going to do? (eat them!) 7. What did Henny Penny find out at the end? (it was just an acorn!) 8. What is the lesson? The Problem: Henny Penny panicked without checking! Questions: - Have YOU ever panicked about something that wasn't a big deal? - What should Henny Penny have done FIRST? (Look at what fell on her!) - Why is it important to CHECK before you panic? Lesson: Stay calm! Check the facts! | CAUSE | EFFECT | |-------|--------| | Acorn fell on Henny Penny | She thought the sky was falling | | She told Ducky Lucky | Ducky believed her and came along | | She told Goosey Loosey | Goosey believed and came along | | She told Turkey Lurkey | Turkey believed and came along | | They all panicked | Foxy Loxy tried to trick them | | Henny Penny noticed the den | They ran away from the fox | | They checked what really fell | Found out it was just an acorn! | Big lesson: One MISTAKE → Everyone panics! Always check first! Someone tells you: - \"There's a monster under your bed!\" → Check first! (Look under bed) - \"Your shoe is untied!\" → Check first! (Look at your shoes) - \"It's raining outside!\" → Check first! (Look out window) - \"The sky is falling!\" → Check first! (Look at what fell!) Don't just believe—CHECK! - One person is Henny Penny (gets bonked, yells \"The sky is falling!\") - Others are Ducky, Goosey, Turkey (panic and run!) - One person is Foxy Loxy (tries to trick them—sly voice!) - Everyone runs, stops, finds the acorn - Everyone laughs—we were silly! This story ADDS characters one by one: 1. Henny Penny alone 2. + Ducky Lucky 3. + Goosey Loosey 4. + Turkey Lurkey 5. + Foxy Loxy (tricky!) Other cumulative stories: - Enormous Turnip (adds helpers) - Bremen Musicians (adds animals) - Henny Penny (adds believers!) Pattern: Each new character joins the group! - Henny Penny (rhymes!) - Ducky Lucky (rhymes!) - Goosey Loosey (rhymes!) - Turkey Lurkey (rhymes!) - Foxy Loxy (rhymes!) Make your own rhyming names: - Bunny Sunny - Piggy Wiggy - Froggy Boggy - Mousey Housey Rhyming is fun! - Boy Who Cried Wolf: He LIED and no one believed him when it was true - Henny Penny: She was WRONG and everyone believed her when it was false - Connection: Both stories are about believing/not believing! Billy the Goat says: \"When reading gets hard, don't panic like Henny Penny! Don't say 'I can't read!' without checking. Sound out the word first. Try your best. THEN ask for help if you need it. Don't give up before you even try!\" Also: Henny Penny had double letters in her name! When you see LL or FF or SS, remember: two letters make ONE sound! Don't panic—just blend! 1. Double letter practice: Henny, Penny, fell, will, tell, call, all, off, hill, follow, silly 2. Silly and memorable: Kids LOVE this story! 3. Important lesson: Don't panic, check facts 4. Cumulative structure: Builds pattern recognition 5. Rhyming names: Phonological awareness (rhyme) 6. Character names are EASY: Simple, repetitive 7. Humor: Kids laugh at the silly animals panicking! - Science: What IS the sky? Can it fall? What are acorns? - Critical Thinking: Checking facts, not panicking, evaluating information - Character Education: Stay calm, think before you act, don't spread rumors - SEL: Managing emotions (panic), checking reality vs. perception - panic (get very scared and not think clearly) - acorn (nut from an oak tree) - sky (the air and space above us) - fact (something that is TRUE) - check (look to see if something is true) - silly (funny, not smart) This story is PERFECT for teaching about: - Rumors (don't spread them without checking!) - \"Fake news\" (check if it's true!) - Social media (don't share before verifying!) Story Source: Public Domain (Folk Tale, also called \"Chicken Little\") BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 29-31 Focus Skills: Double letters (ff, ll, ss), cause & effect, critical thinking, don't panic! Perfect for: Teaching kids to CHECK FACTS and not panic! Silly and fun!",
      "emoji": ""
    }
  ]
}