{
  "coverTitle": "The Little Red Hen",
  "coverAuthor": "A Beginning Reader for Lessons 8-10",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "The Little Red Hen lived on a farm. Her friends were a pig, a cat, and a dog.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "One day, the Little Red Hen found seeds. \"Who will help me plant the seeds?\" said the hen. \"Not I!\" said the pig. \"Not I!\" said the cat. \"Not I!\" said the dog. \"Then I will!\" said the Little Red Hen. And she did.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The seeds grew and grew. Then it was time to cut the wheat. \"Who will help me cut the wheat?\" said the hen. \"Not I!\" said the pig. \"Not I!\" said the cat. \"Not I!\" said the dog. \"Then I will!\" said the Little Red Hen. And she did.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Then it was time to make the wheat into flour. \"Who will help me make the flour?\" said the hen. \"Not I!\" said the pig. \"Not I!\" said the cat. \"Not I!\" said the dog. \"Then I will!\" said the Little Red Hen. And she did.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Then it was time to bake bread. \"Who will help me bake the bread?\" said the hen. \"Not I!\" said the pig. \"Not I!\" said the cat. \"Not I!\" said the dog. \"Then I will!\" said the Little Red Hen. And she did.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The Little Red Hen baked the bread. It smelled so good! The pig came. The cat came. The dog came. \"Yum!\" they said.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Who will help me eat the bread?\" said the Little Red Hen. \"I will!\" said the pig. \"I will!\" said the cat. \"I will!\" said the dog.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"No!\" said the Little Red Hen. \"You did not help me plant the seeds. You did not help me cut the wheat. You did not help me make the flour. You did not help me bake the bread.\" \"I did all the work!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"So I will eat the bread!\" And the Little Red Hen ate the hot, fresh bread all by herself. Yum, yum, yum! The end! CVC Words from the Story: hen, red, pig, cat, dog, hot, nap, not, will, dig, cut, bun, sun, did, can, help, all Practice Sentence: \"The red hen will cut and dig to help make hot bread.\" \"Not I!\" said the _____. \"Then I will!\" said the Little Red Hen. \"And she did.\" \"Yum, yum, yum!\" 1. Who lived on the farm? (hen, pig, cat, dog) 2. What did the Little Red Hen find? (seeds) 3. What did she ask her friends to help with? 4. What did the pig, cat, and dog say? (\"Not I!\") 5. Who did all the work? (the Little Red Hen) 6. What happened when the bread was done? 7. Do you think the Little Red Hen was fair? Why or why not? 8. What lesson does this story teach? Put the steps in order! Draw or act them out: 1. Plant the seeds 2. Cut the wheat 3. Make the flour 4. Bake the bread 5. Eat the bread! - One person is the Little Red Hen - Three people are pig, cat, dog - Act out each step! - Say \"Not I!\" together - Say \"Then I will!\" firmly - Pretend to eat at the end! | Little Red Hen (WORKED) | Pig, Cat, Dog (LAZY) | |-------------------------|----------------------| | Planted seeds | Took a nap | | Cut the wheat | Played | | Made flour | Did nothing | | Baked bread | Watched | | Got to eat! | Did NOT get to eat! | Question: Who made better choices? - CAUSE: Friends didn't help → EFFECT: They didn't get to eat - CAUSE: Hen did all the work → EFFECT: She got all the bread! - CAUSE: Seeds were planted → EFFECT: Wheat grew - CAUSE: Wheat was baked → EFFECT: Delicious bread! Big Lesson: If you don't work, you don't eat! (Consequences!) - Was it FAIR that the hen didn't share? - Was it FAIR that the animals didn't help? - What would YOU do? - If you help, should you get a reward? - If you DON'T help, should you still get a reward? Talk about helping: - What chores do you do at home? - How do you help your family? - What happens if no one helps? - How does it feel when everyone works together? - Real recipe: Make simple bread or playdough - Pretend recipe: Use blocks to \"build\" a loaf - Practice sequence: First... Next... Then... Last... Billy the Goat says: \"Climbing the reading mountain takes WORK! You can't take a nap like the lazy pig and expect to reach the top! The Little Red Hen worked hard, and SHE got the bread. YOU work hard at reading, and YOU will get to enjoy great stories!\" Also: The Little Red Hen did things in ORDER—plant, cut, grind, bake. Reading has an order too! Learn sounds first, then blend them, then read words, then sentences, then stories! 1. Review story: Uses ALL the sounds learned so far (Lessons 1-10) 2. Simple vocabulary: Easy CVC words 3. Repetitive structure: Predictable responses build confidence 4. Work ethic theme: Important character lesson 5. Real-world application: Helping at home, consequences of laziness 6. Sequence practice: Clear step-by-step process (plant → cut → grind → bake) - Science: How seeds grow, where bread comes from - Math: Sequence (first, next, then, last) - Social Studies: Farming, community, helping - Character Education: Work ethic, fairness, responsibility - plant (put seeds in the ground) - wheat (a grain that makes flour) - flour (ground-up wheat used for baking) - bake (cook in an oven) - lazy (not wanting to work) - fair (everyone gets what they deserve) Story Source: Public Domain (English Folk Tale) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 8-10 Focus Skills: Review all basic sounds, sequence, work ethic, cause & effect, fairness Perfect for: Teaching responsibility and the value of hard work!",
      "emoji": ""
    }
  ]
}