{
  "coverTitle": "The Little Mermaid (Simple Version)",
  "coverAuthor": "A Beginning Reader for Lessons 54-55",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "Page 1",
      "text": "Far down under the sea, there lived a little mermaid. She had a beautiful tail and long hair. She lived with her sisters in a pearl palace. The little mermaid loved to swim over coral reefs and through forests of sea ferns. But her favorite thing was to swim to the surface and look at the stars.",
      "emoji": ""
    },
    {
      "title": "Page 2",
      "text": "One day, the little mermaid saw a ship on the water above. She swam to the surface. She saw a prince on the ship! He was kind and handsome. Suddenly, a storm came! The ship rocked! The prince fell into the water! \"I must help him!\" cried the little mermaid.",
      "emoji": ""
    },
    {
      "title": "Page 3",
      "text": "The little mermaid dove under the waves. She found the prince sinking down, down, down. She grabbed him and pulled him up! She swam with him to the shore. She laid him on the sand. He was safe! He would not be hurt. Then she swam away before he woke up.",
      "emoji": ""
    },
    {
      "title": "Page 4",
      "text": "The little mermaid swam home. But she could not stop thinking about the prince. \"I want to see him again,\" she said. \"I want to be with him forever.\" \"But I am a mermaid,\" she said sadly. \"He is a human. We can never be together.\" Her sisters tried to cheer her up. But the little mermaid was too sad.",
      "emoji": ""
    },
    {
      "title": "Page 5",
      "text": "The little mermaid swam far from home. She found the sea witch. \"I want legs,\" said the little mermaid. \"I want to walk on land and be with the prince.\" The sea witch smiled. \"I can help you,\" she said. \"But there is a price.\"",
      "emoji": ""
    },
    {
      "title": "Page 6",
      "text": "\"I will give you legs,\" said the witch. \"But you must give me your voice.\" \"And remember,\" said the witch, \"if the prince does not love you, you will turn into sea foam forever.\" The little mermaid thought hard. She loved the prince so much. \"I will do it,\" she said.",
      "emoji": ""
    },
    {
      "title": "Page 7",
      "text": "The sea witch gave the little mermaid a potion. She drank it. Her tail began to change! It split into two legs! But when she tried to speak, no sound came out. Her voice was gone. The little mermaid swam to the surface. She climbed onto the shore.",
      "emoji": ""
    },
    {
      "title": "Page 8",
      "text": "The little mermaid walked to the prince's castle. Every step hurt! It felt like walking on knives! But she did not cry. She walked and walked. The prince saw her. \"Who are you?\" he asked. She could not answer. She had no voice.",
      "emoji": ""
    },
    {
      "title": "Page 9",
      "text": "The prince was kind. He let her stay at the castle. The little mermaid danced for him. She smiled. She was with him, and that made her happy. But the prince did not know she was the one who saved him. He did not know she loved him.",
      "emoji": ""
    },
    {
      "title": "Page 10",
      "text": "One day, the prince told the little mermaid sad news. \"I must marry a princess from another land,\" he said. \"My father says I must.\" The little mermaid's heart broke. But still, she could not speak. She danced at the prince's wedding. Tears filled her eyes.",
      "emoji": ""
    },
    {
      "title": "Page 11",
      "text": "That night, the little mermaid sat by the water. She was very sad. Her sisters came up from the sea. \"We have a way to save you!\" they said. \"Take this knife. You must hurt the prince. Then you can be a mermaid again!\" But the little mermaid shook her head. She loved the prince. She would never hurt him.",
      "emoji": ""
    },
    {
      "title": "Page 12",
      "text": "The little mermaid dropped the knife into the water. She looked at the stars one last time. Then she began to turn into sea foam. But instead of disappearing, she felt light! She was floating up, up, up! Kind spirits of the air caught her. \"You gave everything for love,\" they said. \"You will live forever with us.\" And the little mermaid became a spirit of the air, watching over the sea and the stars. AR R-Controlled: far, star, hard, shark, garden, dark, barn, farm OR R-Controlled: forever, for, storm, torn, horn, corn, sport ER R-Controlled: mermaid, her, fern, sister, water, under, over, never, father IR R-Controlled: first, third, bird, girl, swirl, twirl, shirt UR R-Controlled: turn, hurt, burn, purr, fur, turtle, purple Other Decodable Words: tail, sea, swim, ship, save, sand, legs, walk, dance, smile, kind \"Far under the sea\" | \"Forever\" | \"Never hurt\" | \"Her sisters\" 1. Where did the little mermaid live? (Far under the sea with her sisters) 2. Who did she save? (The prince!) 3. What did she give the sea witch? (Her voice) 4. What did she get in return? (Legs to walk on land) 5. Why didn't she hurt the prince? (She loved him too much) 6. What happened at the end? (She became a spirit of the air) - R-Controlled Review: Sort all r-controlled words by pattern (AR, OR, ER, IR, UR) - Act It Out: Pretend to swim like a mermaid! Then walk on painful legs! - Draw & Write: Draw the little mermaid as a mermaid and as a spirit of the air. - Billy's Connection: Billy the Goat knows that love means putting others first. The mermaid gave everything for love! Theme: True love is selfless. The little mermaid gave up her voice, her home, and even her life—but she wouldn't hurt the prince. She chose love over saving herself. Discussion: Have you ever given up something important for someone you love? Story Source: Hans Christian Andersen (Public Domain) BedrockELA Adaptation: February 2026 (Simplified Version) For use with: BedrockELA 1st Grade Curriculum, Lessons 54-55 **Mountain Connection:** Billy says, \"Love is the strongest magic of all. It changes everything.\" \udc10⛰️💙🧜‍♀️",
      "emoji": "\ud83d"
    }
  ]
}