{
  "coverTitle": "Little Red Riding Hood",
  "coverAuthor": "A Chapter Book for Lessons 61-67",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "Page 1",
      "text": "Once upon a time, there was a little girl who lived in a village near the woods. Everyone called her Little Red Riding Hood because she always wore a red cape with a hood. Her grandmother made it for her, and it was her favorite thing to wear.",
      "emoji": ""
    },
    {
      "title": "Page 2",
      "text": "One day, Little Red's mother said, \"Your grandmother is sick. Can you take this basket of food to her? She lives on the other side of the woods.\" \"Yes, Mother!\" said Little Red. \"I will go right away!\" Mother packed the basket with: - Bread - Butter - A slice of cake - Some fresh eggs",
      "emoji": ""
    },
    {
      "title": "Page 3",
      "text": "\"Now listen,\" said Mother. \"Stay on the pathway. Don't talk to strangers. Go straight to Grandmother's house. Don't stop in the woods!\" \"I won't, Mother!\" said Little Red. \"I promise!\" She put on her red hood, picked up the basket, and headed into the woods.",
      "emoji": ""
    },
    {
      "title": "Page 4",
      "text": "The woods were beautiful. Little Red walked along the pathway. She saw: - Birds singing in the trees - Flowers growing by the edge of the path - Butterflies dancing in the air \"What a nice day!\" said Little Red. She hummed a little song as she walked.",
      "emoji": ""
    },
    {
      "title": "Page 5",
      "text": "Suddenly, a big, gray wolf stepped onto the pathway! \"Good morning, little girl,\" said the wolf in a gentle voice. Little Red stopped. She knew she should not talk to strangers. But the wolf seemed nice... Wrong choice, Little Red!",
      "emoji": ""
    },
    {
      "title": "Page 6",
      "text": "\"Where are you going?\" asked the wolf. \"To my grandmother's house,\" said Little Red. \"She lives on the other side of the woods. She is sick, so I am bringing her food.\" \"How nice of you!\" said the wolf. But inside, he was thinking: *\"Mmm! A little girl AND her grandmother! I could eat them both!\"*",
      "emoji": ""
    },
    {
      "title": "Page 7",
      "text": "\"Why don't you pick some flowers for your grandmother?\" said the wolf. \"Look! There are beautiful flowers over there by that hedge!\" \"Oh! Good idea!\" said Little Red. She left the pathway and went to pick flowers. Wrong again, Little Red!",
      "emoji": ""
    },
    {
      "title": "Page 8",
      "text": "As soon as Little Red left the pathway, the wolf ran ahead! He knew a quick shortcut through the woods. \"I will get to Grandmother's house first!\" he said. \"Then I will eat Grandmother, and when Little Red arrives, I will eat her too!\" The wolf laughed his wicked laugh. Chapter 1 ends here! What will happen next?",
      "emoji": ""
    },
    {
      "title": "Page 9",
      "text": "The wolf arrived at Grandmother's little house. Knock, knock, knock! (Remember: knock has a silent K!) \"Who is there?\" called Grandmother from inside. \"It's me, Little Red!\" said the wolf in a high, fake voice. (He was trying to trick Grandmother!)",
      "emoji": ""
    },
    {
      "title": "Page 10",
      "text": "\"The door is unlocked, dear,\" said Grandmother. \"Come inside!\" The wolf opened the door and went inside. Poor Grandmother! She was lying in bed. She was old and weak. When she saw the wolf, she tried to scream— But it was too late!",
      "emoji": ""
    },
    {
      "title": "Page 11",
      "text": "The wolf gobbled up Grandmother in one big gulp! (Don't worry—in the real story, she's OK later!) Then the wolf put on Grandmother's nightgown. He put on her nightcap. He put on her glasses. He climbed into her bed and pulled up the covers. \"Now I will wait for Little Red!\" he said.",
      "emoji": ""
    },
    {
      "title": "Page 12",
      "text": "Meanwhile, Little Red was still picking flowers. She picked: - White daisies - Yellow buttercups - Purple violets She made a beautiful bouquet. \"Grandmother will love these!\" she said. Then she remembered: \"Oh! I should hurry! Mother said not to stop in the woods!\" She ran back to the pathway and hurried to Grandmother's house.",
      "emoji": ""
    },
    {
      "title": "Page 13",
      "text": "At last, Little Red arrived at the little house. Knock, knock, knock! \"Who is there?\" called a voice from inside. (It was the wolf's voice, but Little Red didn't know that!) \"It's me, Little Red!\" she said. \"Come inside, dear!\" said the voice. Little Red opened the door and went in.",
      "emoji": ""
    },
    {
      "title": "Page 14",
      "text": "The room was dark. Little Red walked to the bed. She could see someone under the covers. \"Hello, Grandmother!\" said Little Red. \"I brought you food and flowers!\" \"Thank you, dear,\" said the wolf in his fake old-woman voice. \"Come closer so I can see you!\" Little Red came closer. Chapter 2 ends here! What will Little Red notice?",
      "emoji": ""
    },
    {
      "title": "Page 15",
      "text": "Little Red looked at \"Grandmother.\" Something was wrong. \"Grandmother,\" she said, \"What big ears you have!\" \"The better to hear you with, my dear!\" said the wolf. Little Red came a little closer.",
      "emoji": ""
    },
    {
      "title": "Page 16",
      "text": "\"Grandmother,\" said Little Red, \"What big eyes you have!\" \"The better to see you with, my dear!\" said the wolf. Little Red felt nervous. She took a step back.",
      "emoji": ""
    },
    {
      "title": "Page 17",
      "text": "\"Grandmother,\" said Little Red, \"What big teeth you have!\" The wolf grinned a big, wicked grin. \"The better to EAT you with!\" he roared! And he jumped out of bed! Little Red screamed! \"HELP! HELP! It's a WOLF!\"",
      "emoji": ""
    },
    {
      "title": "Page 18",
      "text": "The wolf chased Little Red around the room! She ran behind the table! She ran behind the chair! \"Help! Someone help me!\" she cried. The wolf was fast! He was getting closer and closer! Little Red was in terrible danger! Chapter 3 ends here! Will someone save her?",
      "emoji": ""
    },
    {
      "title": "Page 19",
      "text": "Just then— A woodcutter was walking by outside! (A woodcutter is someone who cuts down trees. Woodcutter is a compound word: wood + cutter = woodcutter!) He heard Little Red screaming! \"That sounds like trouble!\" he said. He ran to the house with his axe!",
      "emoji": ""
    },
    {
      "title": "Page 20",
      "text": "The woodcutter burst through the door! He saw the wolf chasing Little Red! \"Stop right there, wolf!\" he shouted. The wolf turned around. When he saw the big woodcutter with the big axe, the wolf got scared! \"Uh oh!\" said the wolf.",
      "emoji": ""
    },
    {
      "title": "Page 21",
      "text": "The wolf tried to run away! But the woodcutter was quick! He caught the wolf! \"Spit out Grandmother, you wicked wolf!\" said the woodcutter. The wolf had to spit out Grandmother. She was OK! (A little wet, but OK!)",
      "emoji": ""
    },
    {
      "title": "Page 22",
      "text": "The woodcutter chased the wolf out of the house. \"Get out of here!\" he shouted. \"And don't come back!\" The wolf ran into the woods as fast as he could. He never came back. Little Red and Grandmother were safe!",
      "emoji": ""
    },
    {
      "title": "Page 23",
      "text": "\"Thank you for saving us!\" said Little Red. \"You are very brave!\" said Grandmother. \"I am just glad you are both safe!\" said the woodcutter. Grandmother got out of bed. Little Red unpacked the basket of food. They all sat down and had a nice meal together.",
      "emoji": ""
    },
    {
      "title": "Page 24",
      "text": "After the meal, the woodcutter walked Little Red home. When they arrived, Mother was so happy to see her! \"Did you stay on the pathway?\" asked Mother. Little Red hung her head. \"No, Mother,\" she said. \"I didn't. I talked to the wolf. I left the pathway to pick flowers. I'm sorry. I shouldn't have done that.\"",
      "emoji": ""
    },
    {
      "title": "Page 25",
      "text": "\"I'm just glad you're safe,\" said Mother. \"I learned my lesson!\" said Little Red. \"From now on, I will: - Stay on the pathway - Not talk to strangers - Listen to what you say!\" \"That's my smart girl!\" said Mother. And Little Red never went into the woods alone again. The lesson: Listen to good advice! Stay safe! Don't talk to strangers! THE END! ### \udf89 YOU READ A CHAPTER BOOK! 🎉 Congratulations! You just read your FIRST chapter book! That's 25 pages across 4 chapters! You are a REAL reader now! 📚✨ Soft C words: nice, place, face, slice, dance, voice, twice Soft G words: village, gentle, giant (if mentioned), age, stage CK words: back, basket, track, knock, quick, stick, black, trick TCH/DGE words: catch, watch, match, patch, edge, hedge, bridge Silent K: know, knock, knife, knight Silent W: wrong, write, wrap WH words: what, when, where, white, why, who Compound words: grand+mother, wood+cutter, some+one, out+side, in+side, path+way, short+cut Contractions: don't, can't, won't, I'll, didn't, couldn't, shouldn't This story has EVERYTHING you learned in Lessons 61-67! Chapter 1: The Journey Begins - Little Red gets basket of food - Mother warns: stay on path, don't talk to strangers - Little Red meets wolf (mistake!) - Wolf tricks her into picking flowers - Wolf runs ahead to Grandma's house Chapter 2: At Grandmother's House - Wolf knocks on door (silent K!) - Wolf eats Grandmother (she's OK later!) - Wolf dresses as Grandma (disguise!) - Little Red arrives at house - Goes inside (doesn't know it's the wolf!) Chapter 3: Something Is Wrong! - Little Red notices big ears, big eyes, big teeth - Wolf reveals himself! \"The better to EAT you!\" - Chases Little Red around the room - Little Red screams for help! Chapter 4: The Rescue! - Woodcutter hears screaming - Bursts in with axe! - Makes wolf spit out Grandma - Chases wolf away - Everyone is safe! - Little Red learns her lesson 1. Why was Little Red going to Grandmother's house? 2. What did Mother tell her NOT to do? 3. Did Little Red listen? (NO!) 4. Who did she meet in the woods? 5. What mistakes did Little Red make? 6. What happened to Grandmother? 7. How did Little Red know something was wrong? 8. Who saved them? 9. What lesson did Little Red learn? 10. What are the lessons of this story? You just read a REAL chapter book! Make a certificate: \"I Read My First Chapter Book!\" Stats: - 4 chapters - 25 pages - Lots of advanced patterns! You are officially a CHAPTER BOOK READER! 📖✨ This story teaches IMPORTANT safety rules: 1. Stay on the path (don't wander off) 2. Don't talk to strangers (even if they seem nice!) 3. Listen to your parents (they keep you safe!) 4. Trust your instincts (if something feels wrong, it IS wrong!) Discussion: How can YOU stay safe? Little Red's Mistakes: 1. Talked to the wolf (stranger!) 2. Told him where she was going 3. Left the path to pick flowers 4. Didn't recognize the wolf in disguise right away What she SHOULD have done: 1. Not talk to the wolf 2. Stay on the path 3. Go straight to Grandma's 4. Run away when she first noticed something wrong Lesson: Mistakes can be dangerous! Listen to good advice! Practice reading with different voices: - Little Red: Soft, sweet, innocent - Mother: Caring, warning - Wolf (as wolf): Sneaky, sly - Wolf (as Grandma): High, fake, trying to trick - Grandmother: Old, gentle, weak - Woodcutter: Strong, brave, heroic Act it out with different voices! At the end of each chapter, we asked: \"What will happen next?\" Were your predictions right? - Did you think the wolf would eat Grandma? ✓ - Did you think Little Red would notice something wrong? ✓ - Did you think someone would save them? ✓ Good readers make predictions! There are many versions of this story! In some versions: - Grandmother and Little Red are eaten but rescued alive from wolf's belly! - Woodcutter fills wolf's belly with stones! - Wolf falls into a well and drowns! Our version is gentler (for first graders!) Compound word = two words stuck together! In the story: - grand + mother = grandmother - wood + cutter = woodcutter - some + one = someone - out + side = outside - in + side = inside - path + way = pathway - short + cut = shortcut (wolf's trick!) Make your own! bed + room = bedroom, sun + shine = sunshine... Billy the Goat says: \"Little Red Riding Hood read a CHAPTER BOOK and so did YOU! This is a HUGE milestone in your reading journey! Just like Little Red had to navigate a dangerous path through the woods, you're navigating the reading mountain. And look—you made it through ALL FOUR CHAPTERS! You're amazing!\" Also: Little Red made mistakes but she LEARNED from them. When you make mistakes in reading, that's OK! Learn from them and keep going! 1. Packed with target patterns: Soft C/G, silent letters, CK, TCH/DGE, compounds, contractions—EVERYTHING! 2. Chapter structure: Real milestone—first chapter book! 3. Suspenseful: Kids are hooked! \"What happens next?\" 4. Classic tale: Everyone should know this story 5. Multiple lessons: Safety, listening to parents, stranger danger 6. Character development: Little Red learns and grows 7. Satisfying rescue: Woodcutter saves the day! - Chapters 1-2: Can be shared reading (adult + child) - Chapters 3-4: Child can read more independently - Goal: By end of book, child feels like a \"real reader\"! Use this story to teach: - Stranger danger - Why rules exist (to keep you safe!) - Trusting your instincts - Asking for help when scared Be age-appropriate! Don't scare them, just teach safety! Story Source: Public Domain (European Fairy Tale - Charles Perrault/Brothers Grimm) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 61-67 Focus Skills: Soft C/G, silent letters, CK, TCH/DGE, PH, WH, compounds, contractions, chapter reading! Story Type: Chapter Book! (FIRST ONE!) Perfect for: Major reading milestone + teaching safety lessons! 🐺🧺🪓✨",
      "emoji": "\ud83c"
    }
  ]
}