{
  "coverTitle": "The Little Red Hen (Full Version)",
  "coverAuthor": "A Beginning Reader for Lessons 76-78",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "The Little Red Hen lived on a farm with a lazy cat, a lazy dog, and a lazy pig. The Little Red Hen worked hard every day. But the other animals did nothing! They just napped and played.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "One day, the Little Red Hen found some grains of wheat. \"Look!\" she said. \"I can plant these seeds and grow wheat! Then I can make bread!\" \"That sounds like a lot of work,\" said the cat. And he went back to sleep.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Who will help me plant the wheat?\" asked the Little Red Hen. \"NOT I!\" said the lazy cat. \"NOT I!\" said the lazy dog. \"NOT I!\" said the lazy pig.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"THEN I WILL DO IT MYSELF!\" said the Little Red Hen. And she did. She planted every seed. She watered them every day. She pulled the weeds. It was hard work! But the Little Red Hen did not give up.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The wheat grew tall and golden. The sun shone on it. The rain watered it. Soon it was ready to harvest. \"Who will help me cut the wheat?\" asked the Little Red Hen.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"NOT I!\" said the lazy cat. \"NOT I!\" said the lazy dog. \"NOT I!\" said the lazy pig. \"THEN I WILL DO IT MYSELF!\" said the Little Red Hen. And she did. She cut every stalk of wheat.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Who will help me thresh the wheat?\" asked the Little Red Hen. (Threshing means separating the grains from the stalks!) \"NOT I!\" said the lazy cat. \"NOT I!\" said the lazy dog. \"NOT I!\" said the lazy pig.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"THEN I WILL DO IT MYSELF!\" said the Little Red Hen. And she did. She threshed all the wheat. Whack! Whack! Whack! Her wings were tired. But she kept working.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Who will help me take the wheat to the mill?\" asked the Little Red Hen. (The mill is where wheat is ground into flour!) \"NOT I!\" said the lazy cat. \"NOT I!\" said the lazy dog. \"NOT I!\" said the lazy pig.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"THEN I WILL DO IT MYSELF!\" said the Little Red Hen. And she did. She carried the heavy sack of wheat all the way to the mill. The miller ground it into fine white flour. The Little Red Hen carried the flour back home.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Who will help me make the bread?\" asked the Little Red Hen. \"NOT I!\" said the lazy cat. \"NOT I!\" said the lazy dog. \"NOT I!\" said the lazy pig.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"THEN I WILL DO IT MYSELF!\" said the Little Red Hen VERY ANGRILY. And she did. She mixed the flour with water. She kneaded the dough. She shaped it into a loaf. She put it in the oven to bake. All by herself!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Soon the kitchen smelled WONDERFUL! The bread was baking! Mmmmm! The cat smelled it. The dog smelled it. The pig smelled it. They all came running!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The Little Red Hen took the golden brown loaf out of the oven. It was perfect! The cat came closer. The dog came closer. The pig came closer. They were drooling!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"WHO WILL HELP ME EAT THE BREAD?\" asked the Little Red Hen. \"I WILL!\" said the cat. \"I WILL!\" said the dog. \"I WILL!\" said the pig.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The Little Red Hen looked at them. Her eyes narrowed. \"OH NO YOU WON'T!\" she said.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"You did NOT help me plant the wheat! You did NOT help me cut the wheat! You did NOT help me thresh the wheat! You did NOT help me carry it to the mill! You did NOT help me make the bread! I DID ALL THE WORK MYSELF!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"SO I WILL EAT THE BREAD MYSELF!\" said the Little Red Hen. And she did! She ate the whole loaf— every delicious bite! Yum! Yum! Yum!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The cat, the dog, and the pig just watched. They were very hungry. They were very sad. They had learned a lesson: **If you don't work, you don't eat!** The end! This story is PERFECT for reading with FEELING! Different voices to practice: 1. Little Red Hen (asking for help): Hopeful, friendly \"Who will help me plant the wheat?\" 2. Lazy animals: Bored, lazy, don't-care voice \"NOT I!\" (yawn, stretch) 3. Little Red Hen (doing work): Determined, maybe a little frustrated \"THEN I WILL DO IT MYSELF!\" 4. Little Red Hen (angry at end): VERY angry! \"OH NO YOU WON'T!\" 5. Eager animals: Suddenly excited! \"I WILL! I WILL!\" (too late!) Practice reading the SAME words with DIFFERENT feelings! Notice the punctuation: - ! (exclamation point) = Read with FEELING! Loud! Excited or angry! - ? (question mark) = Voice goes UP at the end (asking) - . (period) = Normal voice, statement Examples: - \"Not I.\" (boring, flat) - \"Not I!\" (stronger, more definite) - \"Who will help me?\" (voice goes up—asking!) \"Who will help me _____?\" \"NOT I!\" (said three times by three animals!) \"THEN I WILL DO IT MYSELF!\" \"I WILL!\" (eager animals) \"OH NO YOU WON'T!\" Challenge: Can you say \"NOT I!\" in a LAZY voice? Can you say \"I WILL!\" in an EAGER voice? 1. Who lived on the farm with the Little Red Hen? 2. What did she find? (grains of wheat) 3. How many times did she ask for help? (6 times!) 4. Did anyone help her? (NO!) 5. What did she have to say every time? (\"Then I will do it myself!\") 6. What did the lazy animals want at the end? (to eat the bread!) 7. Did the Little Red Hen share? (NO!) 8. Was that fair? (YES! She did all the work!) 9. What lesson did the animals learn? | LITTLE RED HEN (WORKED) | CAT, DOG, PIG (LAZY) | |-------------------------|----------------------| | Planted wheat | Napped | | Watered seeds | Played | | Pulled weeds | Did nothing | | Cut wheat | Napped more | | Threshed wheat | Still lazy | | Carried to mill | Resting | | Made bread | Watching | | GOT TO EAT! ✅ | DID NOT EAT! ❌ | Consequence: No work = No reward! 1. Found wheat seeds 2. Planted seeds 3. Watered and weeded 4. Cut the wheat 5. Threshed the wheat 6. Carried to mill 7. Ground into flour 8. Mixed dough 9. Kneaded dough 10. Shaped loaf 11. Baked bread 12. Ate it all herself! That's 12 steps! SO MUCH WORK! | CAUSE | EFFECT | |-------|--------| | Animals didn't help plant | Hen planted alone | | Animals didn't help cut | Hen cut alone | | Animals didn't help with ANYTHING | Hen did EVERYTHING alone | | Bread smelled good | Animals came running | | Animals wanted to eat | Hen said NO! | | Animals didn't work | Animals didn't eat | Big Lesson: Your CHOICES have CONSEQUENCES! Was the Little Red Hen MEAN or FAIR? Arguments for FAIR: - She did ALL the work - They had MANY chances to help - If you don't work, you shouldn't get the reward Could argue MEAN: - She could have shared a little bit - Friends should share Most people say: FAIR! She earned that bread! Question: What would YOU have done? Assign roles: - Little Red Hen (hardworking, gets angrier as story goes on) - Cat (lazy, sleepy voice) - Dog (lazy, bored voice) - Pig (lazy, don't-care voice) Key moments to practice: 1. Asking for help (hopeful!) 2. \"NOT I!\" (lazy, bored—say it THREE times!) 3. \"THEN I WILL DO IT MYSELF!\" (determined, frustrated) 4. Smelling bread (eager! suddenly interested!) 5. \"I WILL!\" (excited!) 6. \"OH NO YOU WON'T!\" (ANGRY!) Practice makes perfect! Short Version (Unit 1, Lessons 8-10): - 9 pages - Basic story - Simple words - Beginning readers Full Version (Unit 3, Lessons 76-78): - 19 pages! - MORE detail - MORE steps shown - Expression practice - Advanced readers **Look how far you've come!** \udf89 When have YOU had to do all the work? - Cleaning your room while siblings play? - Group project where you do everything? - Helping while others don't? How did it feel? - Frustrated? (Like the Hen!) - Proud when done? (Like the Hen!) - Angry when others wanted credit? (Like the Hen!) Lesson: DO YOUR SHARE! Help when asked! Billy the Goat says: \"The Little Red Hen did ALL the work and got ALL the reward! In reading, if YOU do the work (practice every day!), YOU get the reward (you can read ANYTHING!)! But if you're lazy and don't practice... well, you won't get to 'eat the bread' (enjoy great stories)! Put in the WORK!\" Also: Notice how the Little Red Hen's voice CHANGED through the story? At first hopeful, then frustrated, then ANGRY! That's expression! Your reading voice should CHANGE based on the character's feelings! Story Source: Public Domain (Folk Tale) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 76-78 Focus Skills: Reading with EXPRESSION! Punctuation guides voice! Work ethic, consequences, fairness Perfect for: Teaching fluent, expressive reading + work ethic lesson! 🐔🍞✨",
      "emoji": "\ud83c"
    }
  ]
}