{
  "coverTitle": "The North Wind and the Sun",
  "coverAuthor": "A Beginning Reader for Lessons 49-51",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "One day, the North Wind and the Sun had an argument. \"I am stronger than you!\" said the North Wind. \"No, I am stronger!\" said the Sun. \"Let's have a contest!\" said the North Wind. \"Whoever can make that farmer take off his coat will win!\" \"Deal!\" said the Sun.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The farmer was walking down the road. He wore a thick warm coat. \"Watch me!\" said the North Wind. \"I will make him take off his coat!\" The North Wind began to blow. WHOOOOSH!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The North Wind blew hard. WHOOOOSH! WHOOOOSH! But the farmer just pulled his coat tighter. \"It's cold!\" said the farmer. \"I need my coat!\" The North Wind blew harder! WHOOOOOOOOSH!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The North Wind blew and blew. He blew so hard that a storm came! Dark clouds filled the sky. The farmer held his coat even tighter. \"This storm is terrible!\" said the farmer. \"I must keep my coat on or I will freeze!\" The North Wind blew until he was tired.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "At last, the North Wind stopped. He was tired. \"I could not make him take off his coat!\" he said. \"You used too much force,\" said the Sun. \"Now it is my turn. Watch me!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The Sun began to shine. Gently. Warmly. The farmer looked up at the sky. \"Oh!\" he said. \"The storm is over! The Sun is out! It feels warm!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The Sun shone a little more. It got warmer and warmer. \"It's getting hot!\" said the farmer. He unbuttoned his coat. But he did not take it off yet.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The Sun shone even more. Now it was very warm! \"I'm so hot!\" said the farmer. He took off his coat! \"That's better!\" he said. He put his coat over his arm and kept walking.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The Sun smiled. \"I won!\" said the Sun. The North Wind was quiet. \"You see,\" said the Sun, \"Warm kindness works better than cold force. Being gentle is stronger than being hard!\" The lesson: Gentleness and kindness work better than force! The end! AR words: arm, farmer, hard, harder, warm, warmer, march, dark, start, part OR words: North, or, storm, short, force, before, more, corner, wore, worn ER words: over, after, under, never, ever, better, her \"Bossy R\" Rule: When a vowel is followed by R, the R changes the sound! - AR says /ar/ like in \"car\" - OR says /or/ like in \"for\" - ER says /er/ like in \"her\" AR Practice Sentence: \"The farmer walked far from the barn in the dark with hard shoes on!\" OR Practice Sentence: \"The North wind blew before the storm with force or more!\" ER Practice Sentence: \"The Sun is better than ever when it shines over her after the storm!\" \"WHOOOOSH!\" \"I am stronger than you!\" \"Watch me!\" \"The Sun is out! It feels warm!\" \"That's better!\" \"Gentleness works better than force!\" 1. Who had an argument? (the North Wind and the Sun) 2. What were they arguing about? (who was stronger) 3. What was the contest? (make the farmer take off his coat) 4. What did the North Wind do? (blew hard, made a storm) 5. Did it work? (NO! The farmer held his coat tighter!) 6. What did the Sun do? (shone gently and warmly) 7. Did it work? (YES! The farmer took off his coat!) 8. What is the lesson? | NORTH WIND | SUN | |------------|-----| | Blew HARD | Shone GENTLY | | Used FORCE | Used WARMTH | | Made a STORM | Made it WARM | | Farmer held coat TIGHTER | Farmer took coat OFF | | FAILED | WON! | Question: Why did the Sun WIN? Answer: Gentle kindness works better than harsh force! | CAUSE | EFFECT | |-------|--------| | North Wind blew hard | Farmer held coat tighter | | North Wind made storm | Farmer needed coat more | | Sun shone gently | Farmer felt warm | | Sun shone more | It got warmer | | It got very warm | Farmer took off coat! | Lesson: How you DO something matters! FORCE approach (North Wind): - Harsh, mean - Blowing, storming - Makes people resist KINDNESS approach (Sun): - Gentle, warm - Shining, warming - Makes people cooperate Real-life examples: - Parent yelling vs. parent talking kindly - Bully forcing vs. friend asking nicely - Teacher being mean vs. teacher being patient Question: Which works BETTER? (Kindness!) - North Wind: Blow hard! WHOOOOSH! Make wind sounds! Wave arms! - Farmer: Hold coat tight! It's cold! Brrr! - Sun: Smile! Shine gently! Spread arms like rays! - Farmer: Get warm! Unbutton coat! Take it off! Ahhhh! Take turns being each character! North Wind brings: - COLD air - STORMS - Dark clouds - Wind Sun brings: - WARMTH - Light - Blue sky - Nice weather Question: Which weather do YOU like better? What is PERSUASION? Getting someone to do what you want Two ways to persuade: 1. Force: Making them do it (North Wind) 2. Kindness: Convincing them gently (Sun) Which is BETTER? Kindness! Questions: - Has anyone ever FORCED you to do something? How did it feel? - Has anyone ever been NICE and you WANTED to help? How did that feel? - Which way do YOU want to treat people? Find all the R-controlled words in the story! AR words: ___ (count them!) OR words: ___ (count them!) ER words: ___ (count them!) Challenge: Can you find at least 20 total? - Lion & Mouse: Kindness pays off (mouse saved lion) - North Wind & Sun: Kindness WINS (Sun won contest) - Boy Who Cried Wolf: Being mean (lying) = bad result - North Wind & Sun: Being mean (force) = bad result - Pattern: KINDNESS = GOOD! MEANNESS = BAD! - North Wind: WHOOOOOOSH! (blow!) - Storm: BOOM! CRASH! (thunder!) - Rain: Pitter patter pitter patter! (tap fingers) - Sun: Ahhhhhh! (warm, gentle) Play weather symphony: Everyone makes different weather sounds! Billy the Goat says: \"When learning to read gets HARD, don't be harsh on yourself like the North Wind! Be WARM and gentle like the Sun! If you're kind to yourself and keep trying GENTLY, you'll learn BETTER than if you get mad and frustrated! Gentle practice works better than forcing it!\" Also: The Sun won by being SMART, not by being HARSH. In reading, work SMARTER, not HARDER! Use tricks like R-controlled vowels to make reading EASIER! 1. Natural R-controlled words: north, storm, farmer, warm, harder, better, over, never, etc. 2. Short & sweet: Quick read, perfect for introducing new skill 3. Clear moral: Easy to understand and discuss 4. Competition structure: Engaging (who will win?) 5. Memorable: Kids remember this fable! 6. Contrast: Two VERY different approaches (force vs. kindness) 7. Visual: Easy to picture in your mind - Science: Weather (wind, sun, storms, temperature) - Social Studies: Persuasion, cooperation, conflict resolution - Character Education: Kindness, gentleness, patience vs. force - SEL: How to influence others positively, choosing kindness - north (direction—cold comes from the north!) - force (using strength or power to make something happen) - storm (bad weather with wind, rain, clouds) - gentle (soft, kind, not harsh) - persuasion (getting someone to do something) - harsh (rough, mean, hard) - argument (disagreement, fight with words) Story Source: Public Domain (Aesop's Fable) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 49-51 Focus Skills: R-controlled vowels (AR, OR, ER), compare/contrast, theme (kindness vs. force), cause & effect Story Type: Fable (teaches a lesson) **Perfect for:** Introducing Bossy R while teaching that kindness works better than force! ☀❄️💨",
      "emoji": "️"
    }
  ]
}