{
  "coverTitle": "The Shoemaker and the Elves",
  "coverAuthor": "A Beginning Reader for Lessons 18-20",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "Page 1",
      "text": "There was a shoemaker. He made shoes in his shop. But this year was hard. He did not have much money. \"What will we do?\" said the shoemaker.",
      "emoji": ""
    },
    {
      "title": "Page 2",
      "text": "One night, the shoemaker cut out leather for shoes. \"I wish I could make these shoes,\" he said. \"But I am too tired.\" He shut the shop door and went to bed.",
      "emoji": ""
    },
    {
      "title": "Page 3",
      "text": "In the morning, the shoemaker came to his shop. \"What is this?!\" he said. The shoes were done! They were perfect! Every stitch was just right! \"Who made these?!\" said the shoemaker.",
      "emoji": ""
    },
    {
      "title": "Page 4",
      "text": "A rich man came to the shop. \"These shoes are so good!\" he said. \"I will take them!\" He gave the shoemaker much money. Then the rich man left with the shoes.",
      "emoji": ""
    },
    {
      "title": "Page 5",
      "text": "That night, the shoemaker cut out leather for two pairs of shoes. \"I still wish I knew who helped me!\" he said. Then he shut the shop door and went to bed.",
      "emoji": ""
    },
    {
      "title": "Page 6",
      "text": "In the morning, both pairs of shoes were done! \"This is amazing!\" said the shoemaker. More people came to the shop. They all wanted the shoes! The shoemaker got rich!",
      "emoji": ""
    },
    {
      "title": "Page 7",
      "text": "That night, the shoemaker said to his wife, \"Let's stay up and see who is helping us! We will hide and watch!\" \"Shhhh! Hush!\" said his wife. They hid behind a bench.",
      "emoji": ""
    },
    {
      "title": "Page 8",
      "text": "At midnight, three tiny elves came in! Tip, tap, tip, tap! They were so small! They had no shoes! They had no shirts! They began to make the shoes. Stitch, stitch, stitch!",
      "emoji": ""
    },
    {
      "title": "Page 9",
      "text": "The elves worked all night. Stitch, stitch, stitch! Tap, tap, tap! Then, when the shoes were done, they ran off! Tip, tap, tip, tap! And they were gone!",
      "emoji": ""
    },
    {
      "title": "Page 10",
      "text": "\"Those tiny elves helped us!\" said the shoemaker. \"They have no shoes!\" said his wife. \"They have no shirts!\" \"We must thank them!\" said the shoemaker. \"Let's make them gifts!\"",
      "emoji": ""
    },
    {
      "title": "Page 11",
      "text": "That day, the shoemaker made three tiny pairs of shoes. His wife made three tiny shirts. They made three tiny hats. Stitch, stitch, stitch!",
      "emoji": ""
    },
    {
      "title": "Page 12",
      "text": "That night, they left the gifts on the bench. Then they hid and waited. \"Shhhh! Hush!\" said the wife.",
      "emoji": ""
    },
    {
      "title": "Page 13",
      "text": "At midnight, the three elves came in! They saw the gifts! \"For us?!\" they said. They put on the shirts. They put on the shoes. They put on the hats. They danced and danced!",
      "emoji": ""
    },
    {
      "title": "Page 14",
      "text": "Then the elves said, \"Thank you, thank you! We are so happy! Now we can go and help others!\" And they danced out the door! Tip, tap, tip, tap! They never came back.",
      "emoji": ""
    },
    {
      "title": "Page 15",
      "text": "But the shoemaker was still rich. He never forgot the kind elves. The lesson: When you are kind to others, they will be kind to you! The end! TH words: this, that, them, then, thank, three, with, path SH words: shoe, shop, wish, dish, rush, hush, shut, shed, shirt CH words: much, such, which, rich, bench, lunch, stitch, patch TH Practice Sentence: \"This is the path that goes with them and then they say thank you.\" SH Practice Sentence: \"I wish for a shoe in the shop and I will hush and shut the door!\" CH Practice Sentence: \"How much is such a rich man's lunch on the bench?\" \"Stitch, stitch, stitch!\" \"Tip, tap, tip, tap!\" \"Shhhh! Hush!\" \"What is this?!\" \"Who made these?!\" \"Thank you, thank you!\" 1. What did the shoemaker make? (shoes) 2. Why was he sad at first? (no money, very poor) 3. What happened when he woke up? (shoes were done!) 4. Who was making the shoes? (three tiny elves) 5. What did the elves NOT have? (shoes, shirts, hats) 6. What did the shoemaker and his wife make? (gifts for the elves!) 7. How did the elves feel when they got the gifts? (so happy! they danced!) 8. What is the lesson of this story? While reading, PAUSE and ask: - \"WHO do you think is making the shoes?\" (guess before revealing the elves!) - \"What will the shoemaker do when he finds out?\" - \"What do you think the elves will do with the gifts?\" This builds prediction skills! | WHO WAS KIND | WHAT THEY DID | WHAT HAPPENED NEXT | |--------------|---------------|---------------------| | Elves | Made shoes for shoemaker | Shoemaker got rich | | Shoemaker & wife | Made clothes for elves | Elves were so happy! | The lesson: Kindness creates MORE kindness! - Shoemaker: Pretend to cut leather (snip, snip!) - Elves: Tiptoe quietly (tip, tap, tip, tap!), sew shoes (stitch, stitch!), dance when you get gifts! - Wife: Say \"Shhhh! Hush!\" and hide - Everyone can take turns being each character! Gratitude = Being thankful - The shoemaker was GRATEFUL to the elves - He showed his gratitude by making them gifts - How do YOU show you're thankful? - When has someone helped you? Did you say thank you? - When have YOU helped someone? This story happens at NIGHT! - The elves come at MIDNIGHT (when it's dark) - Everyone is asleep - It's a SECRET until the shoemaker hides and watches - Setting practice: Where and WHEN does the story happen? - Draw tiny shoes for elves - Cut them out - Decorate them - How small would shoes be for a tiny elf? - Practice: BIG shoes (for people) vs. TINY shoes (for elves) - Little Red Hen: She did all the work herself, no one helped her - Shoemaker & Elves: Elves helped him! Then HE helped THEM back! - Connection: Helping each other is best! Billy the Goat says: \"Sometimes reading feels like hard work, like making shoes stitch by stitch. But when you practice every night (like the elves came every night!), you wake up and you're BETTER! Magic happens when you practice!\" Also: The shoemaker said \"THANK YOU\" by making gifts. Say THANK YOU to people who help you learn to read! 1. TH/SH/CH practice: Tons of consonant team words! 2. Mystery element: Keeps kids engaged (WHO is helping?) 3. Nighttime magic: Elves come at midnight (exciting!) 4. Kindness theme: Beautiful reciprocal kindness 5. Gratitude lesson: Saying thank you and showing it 6. Predictable structure: Repeated pattern (cut leather → shoes done → sold) - Social Studies: Jobs (shoemaker), helping community - Character Education: Kindness, gratitude, hard work - Art: Design elf clothes or shoes - Math: Counting (three elves, three pairs of shoes, money) - shoemaker (person who makes shoes) - leather (material from animal skin, used for shoes) - stitch (sew with needle and thread) - elves (tiny magical helpers) - midnight (12:00 at night, the middle of the night) - gratitude (being thankful) - gifts (presents you give to show you care) Story Source: Public Domain (Brothers Grimm) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 18-20 Focus Skills: TH/SH/CH consonant teams, mystery/predictions, kindness, gratitude, nighttime setting Perfect for: Teaching kindness and gratitude through a magical, mysterious story!",
      "emoji": ""
    }
  ]
}