{
  "coverTitle": "The Elves and the Shoemaker (Extended)",
  "coverAuthor": "A Beginning Reader for Lesson 48",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "Once upon a time, there was a shoemaker. He was very poor. He had just enough leather to make one pair of shoes. Just one. \"This is my last bit of leather,\" he said sadly. \"I will try to make one more pair. Then I will have no more.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "That night, the shoemaker cut the leather. He laid it on his workbench. \"I am too tired to finish,\" he said. \"I will sew the shoes in the morning.\" He went to bed. His wife did too. The workshop was dark and quiet.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "In the morning, the shoemaker went to his bench. He gasped! The shoes were done! And they were perfect! Shiny and pretty! \"Who did this?\" he cried. \"These are the most pretty shoes I have ever seen! Very fine work!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "A rich man came into the shop. He saw the shiny shoes. \"These are beautiful!\" he said. \"I will buy them!\" He paid the shoemaker well. Very well! Now the shoemaker had money to buy leather for two more pairs! \"My luck is changing!\" he said happily.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "That night, the shoemaker cut leather for two pairs of shoes. He left the pieces on his bench. \"I will sew them in the morning,\" he said. But in the morning, both pairs were done! Shiny and perfect! \"This is very strange!\" said his wife. \"Who is helping us?\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The shoes sold quickly. The shoemaker bought leather for four more pairs. Again, he cut the leather at night. Again, he left it on the bench. In the morning, all four pairs were done! Very pretty and shiny! \"We must find out who is helping us!\" said the shoemaker.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "That night, the shoemaker and his wife hid. They wanted to spy! They waited. The workshop was dark and still. Then, at midnight, tiny elves appeared! Two of them! They were very small. They wore rags. They had no shoes!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The tiny elves jumped onto the bench. They worked very fast! Tap-tap-tap! Stitch-stitch-stitch! Their hands flew! They sewed and hammered. By morning, all the shoes were done! Then the elves ran away and hid. \"Those tiny elves helped us!\" whispered the wife. \"They work so hard! But they have no shoes!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The shoemaker and his wife felt very grateful. \"Let's make them a gift!\" said the wife. \"They have been so kind!\" So the shoemaker made two tiny pairs of shoes. Very small! Perfect for elf feet! The wife sewed two tiny outfits. Pretty shirts and pants. They laid the gifts on the bench.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "That night, the elves came back. They saw the tiny shoes and clothes! They were very happy! They clapped and danced! They put on their new clothes and shoes. They looked so shiny and pretty! They danced around the workshop. Then they flew out the window!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The elves never came back. But the shoemaker did not mind. He had learned to make shoes very well by watching the elves! His shop did well. He and his wife were never poor again. And they were always kind to others, just as the elves had been kind to them.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "THE END Kindness brings happiness! The tiny elves helped the shoemaker. The shoemaker helped the elves. Everyone was happy! Y as /ī/ (long i sound): my, by, fly, shy, spy, dry, try, cry, why, sky Y as /ē/ (long e sound): tiny, happy, very, pretty, shiny, lucky, silly, funny, dusty, misty Other Decodable Words: elf, elves, shop, bench, cut, sew, pair, made, done, fast, gift \"Very pretty!\" | \"Tiny elves!\" | \"My shoes!\" 1. What did the elves do? (They made shoes at night!) 2. How many elves were there? (Two tiny elves!) 3. What did the shoemaker and his wife make for the elves? (Tiny shoes and clothes!) 4. How did the elves feel when they got the gifts? (Very happy!) 5. What is the lesson? (Kindness should be repaid. Help those who help you!) - Y Hunt: Find all the Y words. Sort them: Does Y say /ī/ or /ē/? - Act It Out: Pretend to be tiny elves! Sew very fast! Dance when you get gifts! - Draw & Write: Draw the tiny elves in their new clothes and shoes! - Billy's Connection: Billy the Goat helps his mountain friends, and they help him back! Kindness makes everyone happy! Theme: Gratitude and generosity. When someone helps you, find a way to help them back! The shoemaker and the elves created a beautiful cycle of kindness. Discussion: Has anyone ever helped you? How did you say thank you? Story Source: Brothers Grimm Fairy Tale (Public Domain) BedrockELA Adaptation: February 2026 (Extended Version) For use with: BedrockELA 1st Grade Curriculum, Lesson 48 **Mountain Connection:** Billy says, \"Help each other! That's what friends do!\" \udc10⛰️✨",
      "emoji": "\ud83d"
    }
  ]
}