{
  "coverTitle": "Stone Soup",
  "coverAuthor": "A Beginning Reader for Lessons 34-39",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "Three travelers came to a small village. They were tired. They were hungry. \"We need a place to rest,\" they said. \"We need some food to eat.\" But the village people were not kind.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The travelers went to the first home. Knock, knock, knock! \"Can you give us some food?\" they asked. \"No!\" said the woman. \"I have none to spare! Go away!\" And she shut the door.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The travelers went to another home. Knock, knock, knock! \"Can you share some food?\" they asked. \"No!\" said the man. \"I am too poor! Go away!\" And he shut the door.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The travelers tried every home in the village. But no one would help. \"These people are rude,\" said one traveler. \"They will not share,\" said another. \"But we can make them share!\" said the third traveler. \"How?\" asked the others.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"We will make soup from a stone!\" he said. \"A stone?\" said the others. \"You can't make soup from a stone!\" \"Just wait and see!\" he said. And he picked up a huge stone from the ground.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The travelers went to the village square. They made a big fire. They placed a huge pot over the fire. They filled it with water. Then they dropped the stone into the pot. SPLASH! All the villagers came to watch.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"What are you doing?\" asked a villager. \"We are making stone soup!\" said the travelers. \"Stone soup?\" said the villagers. \"That sounds strange!\" \"Oh, it is the best soup!\" said the travelers. \"Stone soup is amazing!\" The villagers came closer to see.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "One traveler tasted the soup. \"Mmmm!\" he said. \"This stone soup will taste so good! But it would taste even better with just a little onion...\" A villager said, \"I have an onion at home! I will go get it!\" And she ran home and came back with an onion. PLOP! Into the soup it went!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Another traveler tasted the soup. \"Mmmm!\" he said. \"This is getting good! But it would taste even better with a carrot...\" \"I have a carrot!\" said a villager. He ran home and came back with a huge carrot. PLOP! Into the soup it went!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The third traveler tasted the soup. \"Mmmm!\" he said. \"Nice! But it would taste even better with a potato...\" \"I have potatoes!\" said a woman. She ran home and came back with five potatoes. PLOP, PLOP, PLOP, PLOP, PLOP!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"You know what else would make this soup amazing?\" said a traveler. \"A bone with some meat on it!\" \"I have a bone!\" said the butcher. He ran home and came back with a huge bone. PLOP! Into the soup it went!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Soon, everyone was bringing things! Cabbage! PLOP! Beans! PLOP! Tomatoes! PLOP! Celery! PLOP! Spices! PLOP! The pot was full of good things! The soup began to smell amazing!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The travelers stirred the soup. \"Almost ready!\" they said. The villagers set up tables. They brought plates and spoons. They brought bread and cake. \"We will all eat together!\" they said.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "At last, the soup was done! The travelers gave each villager a big bowl of soup. Everyone tasted it. \"This is the best soup I ever tasted!\" said one. \"Amazing!\" said another. \"I can't believe we made this from a stone!\" said a third.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The villagers and the travelers ate together. They talked. They laughed. They shared stories. \"Thank you for teaching us to make stone soup!\" said the villagers. The travelers smiled.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The next morning, the travelers got ready to leave. The villagers gave them food for their trip. They gave them warm blankets. They gave them kind words. \"Come back any time!\" said the villagers. \"We will!\" said the travelers. And off they went.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "After the travelers left, one villager said, \"You know, I don't think it was really the stone that made the soup so good...\" \"I think it was all of us working together!\" said another. \"And sharing what we have!\" said a third. They all smiled. The lesson: When we share and work together, amazing things can happen! The end! A_E words: made, came, gave, take, taste, place, same, name, safe, plates I_E words: nice, time O_E words: stone, home, bone, those, close, alone U_E words: rude, huge, cute, use** E_E words: (these - silent e at end doesn't make long e, but good to notice!) Magic E Rule: When a word has a vowel, then a consonant, then an E at the end, the E is SILENT and makes the vowel say its NAME! Examples: - can → cane (short a → long a) - hop → hope (short o → long o) - cut → cute (short u → long u) Practice Sentence: \"They came to the village and made stone soup in a huge pot at the same place near my home!\" \"Knock, knock, knock!\" \"No! Go away!\" \"We will make soup from a stone!\" \"PLOP! Into the soup it went!\" \"Mmmm! This tastes good!\" 1. Who came to the village? (three travelers) 2. What did they need? (food and a place to rest) 3. Did the villagers help at first? (NO! They said no!) 4. What did the travelers say they would make? (stone soup!) 5. What did the villagers bring? (onion, carrot, potatoes, bone, cabbage, beans, tomatoes, spices...) 6. Was the soup really made from a stone? (No! It was made from all the things people shared!) 7. What did the villagers learn? 8. What is the lesson of this story? At the beginning: - Villagers were SELFISH (wouldn't share) - Travelers were ALONE and HUNGRY - Everyone was SEPARATE At the end: - Villagers SHARED what they had - Everyone ATE TOGETHER - They became FRIENDS! Question: What changed? (They learned to SHARE and work TOGETHER!) Put the ingredients in order! 1. Stone (first!) 2. Onion 3. Carrot 4. Potatoes (five!) 5. Bone 6. Cabbage, beans, tomatoes, celery, spices Make your own stone soup! What would YOU add? | CAUSE | EFFECT | |-------|--------| | Travelers asked for food | Villagers said NO | | Travelers said \"stone soup\" | Villagers got curious | | One person brought onion | Others wanted to help too! | | Everyone shared | Soup was AMAZING! | | They ate together | They became friends! | Big Lesson: One person sharing → Everyone sharing → COMMUNITY! - Scene 1: Knock on doors, everyone says NO - Scene 2: Put stone in pot (use a rock!) - Scene 3: Everyone brings ingredients—PLOP! PLOP! PLOP! - Scene 4: Taste the soup—Mmmm! So good! - Scene 5: Eat together, become friends! Take turns being travelers and villagers! - Get a pot - Add water - Put a clean stone in it (just for fun!) - Everyone brings one vegetable - Make REAL soup together! - Eat and share! **Just like the story!** \udd63 What is cooperation? Working together! What is community? People helping each other! Questions: - Have YOU ever worked together with others to make something? - What happens when everyone helps? - Is it better to share or keep things to yourself? - How did the villagers feel at the END vs. the BEGINNING? Go through the story and find ALL the Magic E words! Challenge: Can you find at least 20? (There are: made, came, gave, take, taste, place, same, name, safe, plates, nice, time, stone, home, bone, those, close, alone, rude, huge, cute, use... and more!) Practice the Magic E rule: | Short Vowel | Add Magic E | Long Vowel | |-------------|-------------|------------| | mad | made | (long a) | | hop | hope | (long o) | | us | use | (long u) | | bit | bite | (long i) | | pet | Pete | (long e) | Try it! What other words can you change with Magic E? - Enormous Turnip: Everyone worked together to pull the turnip - Bremen Musicians: Animals worked together to scare robbers - Stone Soup: Villagers worked together to make soup - Pattern: TEAMWORK = SUCCESS! Billy the Goat says: \"Stone soup teaches us about Magic E AND about sharing! Just like the villagers each brought ONE thing and made something AMAZING, when you learn ONE skill at a time (like Magic E!), you can READ amazing books! Each little bit adds up!\" Also: The travelers were CLEVER! They used the 'stone soup' trick to get people to share. In reading, Magic E is like a TRICK too—a silent E that changes everything! 1. TONS of Magic E words: Every vowel pattern represented 2. Cooperation theme: Beautiful lesson about working together 3. Repetitive structure: Each ingredient = same pattern (builds confidence) 4. Community focus: Relatable to kids' lives (sharing, helping) 5. Cumulative: Like Enormous Turnip and Bremen Musicians—adds people one by one 6. Satisfying ending: Everyone happy, lesson learned 7. Culturally universal: Versions exist in many cultures - Social Studies: Community, cooperation, sharing - Math: Counting ingredients, addition (how many vegetables total?) - Science: Cooking, how heat changes food, nutrition - Character Education: Generosity, cooperation, overcoming selfishness - Cooking: Can actually MAKE stone soup as a class/family project! - traveler (someone who goes from place to place) - village (small town) - rude (not polite, not kind) - share (give some of what you have to others) - cooperation (working together) - community (group of people living/working together) - generous (willing to give and share) Story Source: Public Domain (European Folk Tale - versions in many cultures) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 34-39 Focus Skills: Magic E / CVCe patterns (ALL vowels!), cooperation, sharing, community, sequence Perfect for: Teaching Magic E while teaching the value of sharing and working together! 🥣🪨✨",
      "emoji": "\ud83e"
    }
  ]
}