{
  "coverTitle": "The Three Bears Go Camping",
  "coverAuthor": "A Beginning Reader for Lessons 71-73",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "Page 1",
      "text": "One sunny day, Papa Bear said, \"Let's go camping!\" \"Yes!\" said Baby Bear. \"I want to go fishing!\" Mama Bear packed food. Papa Bear packed the tent. Baby Bear packed his smallest toy. Off they went, walking into the woods.",
      "emoji": ""
    },
    {
      "title": "Page 2",
      "text": "They found the perfect spot by a lake. The trees were tall. The lake was calm. Papa Bear set up the biggest tent. Mama Bear set up a smaller one for Baby Bear. \"Mine is smaller, but I like it!\" said Baby Bear happily.",
      "emoji": ""
    },
    {
      "title": "Page 3",
      "text": "They went fishing! Papa Bear caught the biggest fish. Mama Bear caught a medium fish. Baby Bear caught the smallest fish. \"Mine may be smaller, but it's perfect for me!\" said Baby Bear. They cooked their fish over the fire. It tasted delicious!",
      "emoji": ""
    },
    {
      "title": "Page 4",
      "text": "That night, they sat by the fire. They sang songs. They looked at the stars. \"This is the best day ever!\" said Baby Bear. Then they went to bed in their tents. They were tired from all the walking and fishing. THE END The three bears had a wonderful camping trip! -ING Verbs: camping, walking, fishing, cooking, sleeping, singing, looking -ED Verbs: camped, packed, fished, cooked, looked Comparatives: bigger, biggest, smaller, smallest, best Talk About the Story: 1. Where did the bears go? (Camping by a lake!) 2. What did they do? (Fishing, cooking, singing, looking at stars) 3. Who caught the biggest fish? (Papa Bear!) 4. How did Baby Bear feel about having smaller things? (He was happy!) Story Source: Original BedrockELA Story BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 71-73 **Mountain Connection:** Billy loves camping on the mountain! Fresh air and good friends! \udc10⛰️🏕️",
      "emoji": "\ud83d"
    }
  ]
}