{
  "coverTitle": "The Three Billy Goats Gruff!",
  "coverAuthor": "A Beginning Reader for Lessons 1-10",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "There were three billy goats. A big goat. A mid goat. A wee bit of a goat. They all wanted to go up the hill. Up, up, up to the top! The grass was so good up on top.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "But a big, bad troll sat by the path. He was mad. He was sad. He was a very bad troll. \"No one can go past me!\" said the troll. \"Not a bit! Not a jot! Not at all!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The wee goat ran to the path. Tap, tap, tap. Tap, tap, tap. \"Who is that?\" said the troll. \"It is I! The wee billy goat!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"I am big and bad!\" said the troll. \"I will not let you pass!\" \"Do not nab me!\" said the wee goat. \"I am too wee. I am too slim.\" \"My big pal will come. He is so fat!\" \"Hm,\" said the troll. \"Go on, then.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The wee goat ran and ran. Up, up, up to the top! And the wee goat began to munch. Nom, nom, nom. Yum, yum, yum!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Then the mid goat ran to the path. Tip, tap, tip, tap. Tip, tap, tip, tap. \"Who is that?\" said the troll. \"It is I! The mid billy goat!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"I am big and bad!\" said the troll. \"I will not let you pass!\" \"Do not nab me!\" said the mid goat. \"I am not that big. I am not that fat.\" \"My big pal will come. He is SO big!\" \"Hm,\" said the troll. \"Go on, then.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The mid goat ran and ran. Up, up, up to the top! And the mid goat began to munch. Nom, nom, nom. Yum, yum, yum!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Then the BIG goat ran to the path. STOMP, STOMP, STOMP! STOMP, STOMP, STOMP! \"WHO IS THAT?\" said the troll. \"It is I! The BIG billy goat!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"I am big and bad!\" said the troll. \"I will not let you pass!\" \"Oh yes, you WILL,\" said the big goat. The big goat ran at the troll. He hit him with a BONK! He got him with a BASH! He did a big, big KICK!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The troll ran off. He ran and ran and ran. He did not stop! \"Do not come back!\" said the big goat. And the troll did not. Not a bit. Not a jot. Not at all.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The big goat ran up the hill. Up, up, up to the top! And all three goats sat in the grass. Nom, nom, nom. Yum, yum, yum! The end! CVC Words from the Story: tap, tip, big, bad, mid, wee, bit, sat, ran, mad, sad, fat, got, hit, him, not, nab, did, jot, yum, nom, pal, let, hm \"Tap, tap, tap.\" \"Up, up, up to the top!\" \"Nom, nom, nom.\" \"Yum, yum, yum!\" \"I am big and bad!\" \"Not a bit. Not a jot. Not at all.\" 1. How many goats were there? 2. Who sat by the path? 3. Which goat went first? Which went last? 4. What did the troll say? 5. What happened to the troll at the end? 6. Can you retell the story in your own words? - Letter Sound Hunt: Find words that start with: g (goat, got), b (big, bad), m (mid, mad), t (troll, tap) - Act It Out: Be the goats! Tap across the \"bridge\" (a pillow or line on the floor). Take turns being the troll! - Size Sorting: Find three toys or objects — big, medium (mid), and small (wee). Put them in order! - Billy's Connection: Billy is a goat just like the Three Billy Goats! He helps kids climb the reading mountain, just like the goats climbed to the top of the hill. Story Source: Public Domain (Norwegian Fairy Tale) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 1-10 Focus Skills: CVC blending, basic letter sounds, listening comprehension, sequence",
      "emoji": ""
    }
  ]
}