{
  "coverTitle": "The Three Little Pigs",
  "coverAuthor": "A Beginning Reader for Lessons 11-20",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "Page 1",
      "text": "There were three little pigs. A big pig. A red pig. A wee pig. \"It is time to go!\" said the mama pig. \"Go and make a den of your own!\"",
      "emoji": ""
    },
    {
      "title": "Page 2",
      "text": "The wee pig ran and ran. \"This is fun!\" said the wee pig. \"I do not wish to rush.\" \"I will make my den quick!\" So the wee pig got lots of hay. Swish, swish, swish! A den of hay!",
      "emoji": ""
    },
    {
      "title": "Page 3",
      "text": "The red pig ran and ran. \"This is fun!\" said the red pig. \"I do not wish to rush.\" \"I will make my den quick!\" So the red pig got lots of sticks. Tap, tap, tap! A den of sticks!",
      "emoji": ""
    },
    {
      "title": "Page 4",
      "text": "The big pig ran and ran. \"I will NOT rush,\" said the big pig. \"I wish to make a good den!\" So the big pig got lots of bricks. Thud, thud, thud! A den of bricks! It was a lot of work. But the big pig did not quit.",
      "emoji": ""
    },
    {
      "title": "Page 5",
      "text": "Then a wolf came! The wolf had big teeth. The wolf was bad. The wolf ran to the hay den. \"Little pig, little pig, let me come in!\" \"No, no! Not by the hair on my chinny-chin-chin!\"",
      "emoji": ""
    },
    {
      "title": "Page 6",
      "text": "\"Then I'll huff, and I'll puff, and I'll blow your den in!\" So the wolf huffed. And the wolf puffed. And he blew the hay den in! WHOOOOSH! The wee pig ran and ran! He ran to the den of sticks!",
      "emoji": ""
    },
    {
      "title": "Page 7",
      "text": "The wolf ran to the den of sticks. \"Little pigs, little pigs, let me come in!\" \"No, no! Not by the hair on my chinny-chin-chin!\"",
      "emoji": ""
    },
    {
      "title": "Page 8",
      "text": "\"Then I'll huff, and I'll puff, and I'll blow your den in!\" So the wolf huffed. And the wolf puffed. And he blew the stick den in! CRASH! The wee pig and the red pig ran and ran! They ran to the den of bricks!",
      "emoji": ""
    },
    {
      "title": "Page 9",
      "text": "The wolf ran to the den of bricks. \"Little pigs, little pigs, let me come in!\" \"No, no, no! Not by the hair on my chinny-chin-chin!\"",
      "emoji": ""
    },
    {
      "title": "Page 10",
      "text": "\"Then I'll huff, and I'll puff, and I'll blow your den in!\" So the wolf huffed. And the wolf puffed. And he huffed and puffed and huffed! But the den did NOT fall! The bricks were too strong!",
      "emoji": ""
    },
    {
      "title": "Page 11",
      "text": "The wolf got mad. \"I will get in a different way!\" said the wolf. He went up on top of the den. \"I will go in this way!\" said the wolf. And he went down the path to the chimney.",
      "emoji": ""
    },
    {
      "title": "Page 12",
      "text": "But the big pig was smart! The big pig made a big pot of water. Hot, hot, hot! The wolf fell down the chimney. SPLASH! \"YOWL!\" said the wolf. And the wolf ran off. He ran and ran and ran. And he did not come back. Not at all!",
      "emoji": ""
    },
    {
      "title": "Page 13",
      "text": "The three pigs sat in the den of bricks. \"This is a good den!\" said the wee pig. \"This is a strong den!\" said the red pig. \"This is OUR den!\" said the big pig. And all three pigs had a dish of corn. And they sang and they had fun. The end! this, that, then, them, with, path, bath, teeth TH Practice Sentence: \"This is the path that goes with them.\" shed, rush, wish, fish, dish, hush, mash, swish SH Practice Sentence: \"I wish for a fish in a dish!\" \"I'll huff, and I'll puff, and I'll blow your den in!\" \"Not by the hair on my chinny-chin-chin!\" \"Swish, swish, swish!\" | \"Tap, tap, tap!\" | \"Thud, thud, thud!\" 1. How many pigs were there? What did each one make? 2. Which pig worked the hardest? How do you know? 3. What did the wolf say to the pigs? 4. Why couldn't the wolf blow down the brick den? 5. What happened to the wolf at the end? 6. What lesson did the wee pig and red pig learn? - TH & SH Sound Hunt: Find all the words with th and sh in the story. Make two lists! - Act It Out: Be the pigs! Build pretend dens with pillows. Take turns being the wolf! - Three Houses Craft: Draw or build the three dens (hay, sticks, bricks). Which is strongest? - Character Discussion: Was the big pig bossy or just smart? How would you build your den? - Billy's Connection: Billy the Goat also met a mean creature under a bridge! How is the troll like the wolf? How is he different? Story Source: Public Domain (English Fairy Tale) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 11-20 Focus Skills: Consonant teams TH & SH, character traits, cause & effect, hard work vs. shortcuts",
      "emoji": ""
    }
  ]
}