{
  "coverTitle": "The Tortoise and the Hare (Full Version)",
  "coverAuthor": "A Beginning Reader for Lessons 56-58",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "One day, Hare was hopping around the forest. He was very fast. And he was very proud of it. \"Look how fast I am!\" Hare would shout. \"No one can beat me!\" Tortoise walked by, slow and steady. Hare laughed. \"How can you move so slowly? You are like a snail!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Tortoise did not get upset. He said calmly, \"I may be slow, but I always get where I am going.\" \"Ha!\" laughed Hare. \"You? Get anywhere? That takes you all day!\" \"Let's have a race,\" said Tortoise. \"From here to the big oak tree down by the stream.\" Hare's eyes grew wide. Then he burst out laughing! \"You? Race me? This will be easy!\" Hare said proudly.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "All the forest animals came out to watch. Fox stood at the starting line. \"On your mark... get set... GO!\" Hare shot down the path like lightning! Zoom! Tortoise began to walk, slow and steady. One step at a time. \"How is this even a race?\" laughed Hare as he looked back. Tortoise was just a tiny dot far behind.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Hare ran and ran. Soon, he was halfway to the oak tree. He looked around. Tortoise was nowhere in sight! \"I am so far ahead!\" Hare said proudly. \"Tortoise is probably still at the start! I have plenty of time.\" Hare sat down under a shady tree. \"I will rest here for a bit. When Tortoise gets close, I will run and win!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Hare lay down on the soft grass. The sun was warm. The breeze was cool. \"Just a short nap,\" Hare said. \"Then I will race to the finish line.\" Hare closed his eyes. Soon, he was fast asleep. He began to snore. \"Zzzzzz... zzzzz...\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Meanwhile, Tortoise kept walking. Slow and steady. One step. Then another. Then another. Step... step... step... He did not stop. He did not rest. He just kept going. After a while, Tortoise walked past the shady tree. He saw Hare sleeping on the ground! Tortoise smiled. But he did not shout. He did not wake Hare. He just kept walking.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Tortoise walked and walked. Slow and steady. Up the hill. Down the hill. Around the bend. Now the big oak tree was in sight! Tortoise kept going. Step... step... step... He was getting close! Very close!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Back at the shady tree, Hare woke up! He stretched and yawned. \"How long was I asleep?\" he wondered. He looked around. Still no sign of Tortoise! \"Good!\" said Hare. \"I still have time!\" Hare hopped down the path. He was not worried. \"I will win this race easily!\" he said proudly.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "But as Hare came around the bend, he stopped. What did he see? Tortoise was at the oak tree! The finish line! All the animals were cheering! \"Tortoise won! Tortoise won!\" Hare's mouth fell open. \"How did this happen?\" he cried.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Hare ran as fast as he could! He zoomed down the path! But it was too late. Tortoise had already crossed the finish line! Hare stopped, panting. \"I... I lost?\" he said. \"But I am so fast! How did you beat me?\" Tortoise smiled. \"You were fast, Hare. But you stopped. I kept going. Slow and steady wins the race.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Hare hung his head. He was not proud anymore. He was embarrassed. \"You are right,\" Hare said. \"I was too proud. I thought I could not lose. But I did.\" \"It is good to be fast,\" said Tortoise kindly. \"But it is also good to keep trying and not give up. Speed is not everything.\" Hare nodded. \"You have taught me a lesson, Tortoise. Thank you.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "From that day on, Hare was still fast. But he was not so proud. And he never boasted again. Tortoise kept walking, slow and steady, just as always. THE END Slow and steady wins the race! OU Diphthong Words: out, about, shout, proud, found, sound, ground, around, sprout, cloud, loud, mouse, house, mouth OW Diphthong Words: how, now, down, brown, cow, town, crown, frown, owl, growl, vowel Other Decodable Words: hare, race, fast, slow, tree, rest, nap, win, beat, kept, step, stop \"Slow and steady!\" | \"How can you?\" | \"Down the path!\" | \"Around the bend!\" 1. Why was Hare so proud? (He was very fast!) 2. What did Tortoise challenge Hare to? (A race!) 3. What mistake did Hare make? (He stopped to rest and fell asleep!) 4. What did Tortoise do while Hare slept? (He kept walking, slow and steady!) 5. Who won the race? (Tortoise!) 6. What is the lesson? (Slow and steady wins the race! Don't give up!) - OU/OW Hunt: Find all the OU and OW words. Do they all say /ow/? - Act It Out: Act out the race! One person be fast Hare, one be slow Tortoise! - Draw & Write: Draw Hare sleeping and Tortoise passing by! - Billy's Connection: Billy the Goat climbs mountains slowly and carefully. Rushing can be dangerous! Slow and steady gets you to the top safely! Theme: Persistence beats talent when talent doesn't try. Hare was faster, but Tortoise never gave up. Hard work and determination are just as important as natural ability! Discussion: Have you ever worked hard at something even when it was difficult? Did you give up or keep going? Story Source: Aesop's Fable (Public Domain) BedrockELA Adaptation: February 2026 (Full Version) For use with: BedrockELA 1st Grade Curriculum, Lessons 56-58 **Mountain Connection:** Billy says, \"Climbing a mountain takes time! One hoof at a time, slow and steady!\" \udc10⛰️🐢",
      "emoji": "\ud83d"
    }
  ]
}