{
  "coverTitle": "The Tortoise and the Hare",
  "coverAuthor": "A Beginning Reader for Lessons 32-33",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "A hare lived in the woods. He was very, very fast. Zoom, zoom, zoom! \"I am the fastest!\" said the hare.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "A tortoise lived in the woods too. He was very, very slow. Plod, plod, plod. But the tortoise did not mind. \"Slow and steady,\" said the tortoise.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "One day, the hare saw the tortoise. The hare laughed. \"You are so slow!\" said the hare. \"I am so fast! I can run to the hill and back before you take ten steps!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Do not brag,\" said the tortoise. \"Fast is not always best.\" \"Ha!\" said the hare. \"Let's have a race! I will win!\" \"OK,\" said the tortoise. \"Let's race.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "All the animals came to watch. \"Ready... set... GO!\" they said. ZOOM! The hare ran off fast! Plod, plod, plod. The tortoise walked slow.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The hare ran and ran and ran. Zoom, zoom, zoom! He looked back. The tortoise was far, far behind. \"I am winning!\" said the hare.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"The tortoise is so slow,\" said the hare. \"I have time to rest! I will take a quick nap.\" So the hare lay down under a tree. Zzzzz...",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The tortoise kept going. Plod, plod, plod. \"Slow and steady,\" said the tortoise. Plod, plod, plod. He did not stop. He did not rest. He just kept going.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The tortoise plodded past the hare. The hare was still sleeping. Zzzzz... Plod, plod, plod. The tortoise kept going.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The tortoise was getting close to the finish line! Plod, plod, plod. \"Just a little more!\" said the tortoise.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The hare woke up! \"Oh no!\" said the hare. \"I slept too long!\" He jumped up and ran fast! Zoom, zoom, zoom!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "But it was too last! The tortoise crossed the finish line first! \"I win!\" said the tortoise. All the animals cheered! Yay, Tortoise! Yay!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The hare was sad. \"I lost,\" he said. \"I was fast, but I was also lazy. I did not finish the race.\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The tortoise said, \"You are fast. But fast is not enough. You must keep going! You must not give up!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The lesson: Slow and steady wins the race. Don't brag. Don't give up. Keep going, even if you are slow! The end! CVC Words: run, win, nap, fast, can, win, big, sad, had, get Blends: slow, plod, brag, tree, stop, step, fast, just, past, last, finish Digraphs (TH/SH/CH): the, then, that Double Letters: all, will, still Sight Words: the, a, was, were, he, said, I, am, you, so, very, can, will, let, then, but, just, all, who, what This story has EVERYTHING you learned in Unit 1! Practice Sentence (ALL THE SKILLS!): \"The slow tortoise will plod past the fast hare and win the race when the hare takes a nap under the tree!\" \"Zoom, zoom, zoom!\" \"Plod, plod, plod.\" \"Slow and steady.\" \"I am the fastest!\" \"I will win!\" 1. Who was fast? (the hare) 2. Who was slow? (the tortoise) 3. What did they decide to do? (have a race) 4. What did the hare do during the race? (took a nap) 5. What did the tortoise do during the race? (kept going, didn't stop) 6. Who won the race? (the tortoise!) 7. Why did the tortoise win? (he didn't give up, he kept going) 8. What is the lesson? What this means: - Being CONSISTENT is better than being FAST but LAZY - Don't give up, even if you're slower than others - FINISHING is more important than STARTING fast Real-life examples: - Reading: Practice EVERY DAY (slow & steady) vs. reading a lot one day then stopping (fast then lazy) - Learning: Study a little each day (steady) vs. cramming the night before (fast but not steady) - Sports: Practice regularly (steady) vs. practice once then quit (fast start, no finish) Question: Where in YOUR life can you be \"slow and steady\"? | HARE | TORTOISE | |------|----------| | Fast | Slow | | Proud / Brags | Humble | | Lazy (took a nap!) | Hard-working | | Gave up / Got distracted | Didn't give up | | LOST | WON! | Question: Which character would you rather BE? Which won? The hare's problem: He was PROUD and LAZY What he did: - Bragged about being fast - Didn't take the race seriously - Took a nap instead of finishing Result: He LOST! What he SHOULD have done: - Stayed humble - Finished the race - Didn't underestimate the tortoise Lesson: Don't be overconfident! Finish what you start! - Start: Line up for the race! Ready, set, GO! - Hare: Zoom around fast! Look back! Take a nap (lie down, snore!) - Tortoise: Walk slow and steady. Plod, plod, plod. Keep going! Pass the sleeping hare! - Finish: Tortoise crosses first! Hare wakes up too late! - Lesson: Cheer for the tortoise! Slow and steady wins! Take turns being each character! The Tortoise could have: - Looked at the fast hare and said \"I can't win\" - Given up when he was far behind - Stopped to rest because he was tired But he DIDN'T give up! He kept going! Questions: - Have YOU ever wanted to give up? - What happened when you kept going? - Is it OK to be slower than others? (YES!) - What matters more: being FAST or FINISHING? (Finishing!) Hard Work Wins: - Little Red Hen: Worked hard → got bread - Three Pigs: Big pig worked hard → survived - Ant & Grasshopper: Ant worked hard → had food - Tortoise & Hare: Tortoise worked steady → won race - Pattern: CONSISTENT EFFORT = SUCCESS! Don't Be Lazy: - Little Red Hen: Lazy animals didn't get bread - Three Pigs: Lazy pigs' houses fell down - Ant & Grasshopper: Lazy grasshopper had no food - Tortoise & Hare: Lazy hare lost the race - Pattern: LAZINESS = FAILURE! **You just read the LAST story in Unit 1!** \udf89 Look how far you've come: - Lesson 1: You learned your first letter sounds! - Lesson 33: You can read a WHOLE FABLE about a race! You're like the TORTOISE: - You started SLOW (learning one sound at a time) - You kept going STEADY (lesson after lesson) - And now you're WINNING (you can READ!) Don't give up! Unit 2 is next! 🏔️📚 Billy the Goat says: \"I'm not the fastest goat on the mountain. But I keep climbing EVERY DAY. Slow and steady! That's how you reach the top! You might not be the fastest reader YET, but if you practice EVERY DAY and NEVER GIVE UP, you'll get to the top of the reading mountain! Just like the tortoise won the race, YOU will become a GREAT reader!\" Also: The hare was FAST but LAZY. The tortoise was SLOW but STEADY. In reading, STEADY practice beats fast starts! Keep going! 1. Unit 1 REVIEW: Uses ALL the skills learned (CVC, blends, digraphs, sight words) 2. Memorable lesson: \"Slow and steady wins the race\" is a saying they'll remember forever 3. Character contrast: Easy to compare Hare (fast/lazy) vs. Tortoise (slow/steady) 4. Motivational: Perfect ending for Unit 1—don't give up! 5. Classic fable: Everyone should know this story 6. Simple but powerful: Short enough to review, meaningful enough to remember - Science: Tortoises and hares (animals, habitats, speed) - Math: Speed, distance, time (who will finish first?) - Character Education: Humility, perseverance, not giving up - SEL: Managing pride, staying motivated, finishing what you start - PE: Racing, pacing yourself - hare (like a rabbit, but bigger and faster) - tortoise (turtle with a shell, moves very slowly) - race (competition to see who is fastest) - brag (talk too much about how great you are) - steady (consistent, regular, doesn't stop) - slow (not fast) - fast (quick, speedy) - finish (complete, reach the end) This is the LAST story in Unit 1! Celebrate with: - Certificate of completion for Unit 1 - \"I finished Unit 1 like the Tortoise!\" sticker - Review of favorite Unit 1 stories - Look ahead to Unit 2 (more adventures!) Story Source: Public Domain (Aesop's Fable) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 32-33 Focus Skills: REVIEW all Unit 1 skills! CVC, blends, digraphs, sight words, perseverance Story Type: Fable (teaches a lesson) Perfect for: Ending Unit 1 with an inspiring message: Don't give up! Keep going! 🐢🏆",
      "emoji": "\ud83c"
    }
  ]
}