{
  "coverTitle": "The Town Mouse and the Country Mouse",
  "coverAuthor": "A Beginning Reader for Lessons 21-23",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "A Country Mouse lived in the country. He had a small den in the grass. He had fresh cheese. He had peaches from a tree. He had grass seeds. \"This is a good life!\" said the Country Mouse.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "One day, his friend came to visit. It was the Town Mouse! \"Come in!\" said the Country Mouse. \"Let's have lunch!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "They sat down to eat. The Country Mouse gave his friend fresh cheese, a peach, and grass seeds. \"Munch, munch, munch!\" said the Country Mouse.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "But the Town Mouse did not like it. \"What is this?\" said the Town Mouse. \"This food is so plain! You must come to my house in the town! I have such rich food!\" \"Come with me!\" said the Town Mouse.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "So the Country Mouse went to the town with his friend. The town was big! There were lots of houses! There were lots of people! There were lots of fast carts! \"This is different!\" said the Country Mouse.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The Town Mouse took his friend to a grand house. \"This is where I live!\" said the Town Mouse. They went into the dining room.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "There was so much food! Cheese! Cakes! Peaches! Bread! Jam! \"This is a rich lunch!\" said the Town Mouse. \"Munch, munch, munch!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The Country Mouse began to eat. \"This food is so good!\" he said. Munch, munch, munch! But then...",
      "emoji": ""
    },
    {
      "title": "",
      "text": "A big cat came in! \"MEOW!\" \"Run! Fast!\" said the Town Mouse. They ran and hid behind a box. The Country Mouse was so scared!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Then a dog came in! \"WOOF! WOOF!\" \"Run again!\" said the Town Mouse. They ran under the bench. \"This is too much!\" said the Country Mouse.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "When it was safe, the Country Mouse said, \"No, no, no! I do not like this! You have such rich food, but you have so much danger!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"I will go back to the country!\" said the Country Mouse. \"I have just cheese and peaches, but I have peace! I can eat in the fresh grass with no cats! With no dogs!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "So the Country Mouse went back home. He sat in his small den. He ate his fresh cheese. He ate his peach. Munch, munch, munch! \"This is the best!\" he said. The lesson: Where you are happy is the best place to be! The end! CH words: much, such, which, rich, lunch, munch, cheese, peach, bench CH Practice Sentence: \"Which rich mouse will munch much cheese at lunch on the bench?\" FR blends: friend, fresh, from GR blends: grass, grand CR blends: crumb ST blends: best Blend Practice Sentence: \"My best friend ate fresh grass with me in the country!\" \"Munch, munch, munch!\" \"This is so good!\" \"Run! Fast!\" \"No, no, no!\" \"This is the best!\" 1. Where did the Country Mouse live? (in the country, in the grass) 2. Where did the Town Mouse live? (in the town, in a grand house) 3. What food did the Country Mouse have? (cheese, peaches, grass seeds) 4. What food did the Town Mouse have? (rich food—cheese, cakes, peaches, bread, jam) 5. What happened when they tried to eat in the town? (cat and dog came! they had to run!) 6. Which mouse do you think was happier? Why? 7. Where would YOU rather live—town or country? | COUNTRY | TOWN | |---------|------| | Small den in grass | Grand house | | Fresh, plain food | Rich, fancy food | | Quiet and peaceful | Busy and dangerous | | No cats or dogs | Cats and dogs everywhere! | | Country Mouse was HAPPY | Country Mouse was SCARED | Question: Which setting would YOU like better? Setting = WHERE and WHEN a story happens This story has TWO settings: 1. Country (grass, small den, peaceful) 2. Town (big house, lots of people, carts, danger) Practice: - Billy Goats Gruff: WHERE? (bridge, hill with grass) - Three Little Pigs: WHERE? (woods, three houses) - Goldilocks: WHERE? (woods, bears' den) - This story: TWO places! Country AND Town! SAME: - Both mice - Both have cheese - Both are friends DIFFERENT: - Country Mouse: simple food, peaceful, happy - Town Mouse: rich food, dangerous, scared (well, Country Mouse got scared!) Which is BETTER? - Depends on what YOU like! - Country Mouse liked peace more than fancy food - What do YOU value more? - Scene 1: Country—sit in \"grass,\" munch simple food, peaceful - Scene 2: Town—see all the fancy food! Start eating... - Scene 3: CAT! Run and hide! (meow!) - Scene 4: DOG! Run and hide! (woof!) - Scene 5: Country Mouse goes home, happy and safe Take turns being each mouse! - Left side of paper: Draw the COUNTRY (grass, small den, peach tree, peaceful) - Right side of paper: Draw the TOWN (big house, lots of food, cat, dog, busy) - Label each one! Why did the Country Mouse choose to go home? - He liked PEACE more than RICH FOOD - He would rather be SAFE and HAPPY than FANCY and SCARED - Home is where you're happy! Talk about it: - What makes YOU happy? - Do you like busy places or quiet places? - Is \"fancy\" always better? (NO!) The lesson: Home is the best place to be—not because it's fanciest, but because you're HAPPY there! Questions: - What do you like about YOUR home? - Does \"home\" have to be fancy? (NO!) - Can you be happy in a simple place? (YES!) - Lion & Mouse: Small can help big - Fox & Grapes: Don't make excuses - Town & Country Mouse: Home is where you're happy - All Aesop's Fables: They teach lessons! Billy the Goat says: \"I live on a mountain! Not fancy, but I LOVE it! You don't need the fanciest books or the biggest library—you just need stories that make you HAPPY! Find what you love to read, and THAT'S your 'home' in reading!\" Also: The Country Mouse had to RUN FAST from danger! When you practice blends like \"fast,\" \"friend,\" and \"fresh,\" you're getting FASTER at reading! 1. Setting focus: Two clear, contrasting settings (perfect for Lesson 21!) 2. CH words: Lots of practice (much, such, which, rich, lunch, munch, cheese, peach, bench) 3. Blends: friend, best, grass, fresh, grand, fast 4. Compare/contrast: Built into the story structure 5. Relatable: Kids understand preferring one place over another 6. Theme: \"Home is best\" is a comforting message - Social Studies: Town vs. country living, communities - Geography: Different types of places people live - Character Education: Appreciating what you have, knowing what makes YOU happy - SEL: Understanding your own preferences and values - country (rural area, lots of nature, few people) - town (urban area, lots of buildings and people) - setting (where and when a story happens) - plain (simple, not fancy) - rich (in this story: fancy, lots of) - grand (big and fancy) - danger (unsafe, scary) - peace (calm, quiet, safe) Story Source: Public Domain (Aesop's Fable) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 21-23 Focus Skills: Setting (town vs. country), CH words, blends, compare/contrast, theme (home is best) Story Type: Fable (teaches a lesson) Perfect for: Teaching SETTING and the value of being happy where you are!",
      "emoji": ""
    }
  ]
}