{
  "coverTitle": "The Ugly Duckling",
  "coverAuthor": "A Beginning Reader for Lessons 43-45",
  "coverEmoji": "📖",
  "coverColor": "#1B2A4A",
  "pages": [
    {
      "title": "",
      "text": "On a warm summer day, Mother Duck sat on her nest. She had been sitting for a long time. \"When will my eggs hatch?\" she said. \"I can't wait to see my ducklings!\" Then—CRACK! One egg began to hatch!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "One by one, the eggs hatched. CRACK! CRACK! CRACK! Out came three little ducklings! They were sweet and soft. They had yellow fur. They each had a tiny beak. \"Peep! Peep! Peep!\" they said. Mother Duck was so happy!",
      "emoji": ""
    },
    {
      "title": "",
      "text": "But one egg did not hatch. It was the biggest egg. Mother Duck had to keep sitting. \"This egg is taking forever!\" she said. At last—CRACK! Out came the last duckling.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Mother Duck looked at him. He was not like the others. He was bigger. He was gray. His beak was different. His feet were different. \"Oh my!\" said Mother Duck. \"You don't look like the others!\" But she loved him anyway.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Mother Duck took her ducklings to the pond. \"Follow me!\" she said. The three yellow ducklings waddled behind her. The gray duckling came last. The other ducks peeked at him. \"What is that?\" they said. \"He doesn't look like a duck!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"That duckling is ugly!\" said one duck. \"He has big feet!\" said another. \"His beak is too long!\" said a third. \"You are ugly!\" they said to the gray duckling. The little duckling felt sad. He wanted to hide.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Every day, the ducks were mean to him. \"Go away, ugly duckling!\" they said. \"We don't want to see you!\" They would not let him eat with them. They would not let him swim with them. The ugly duckling was so lonely.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "\"Why am I different?\" the ugly duckling asked. \"Why can't I be like the others?\" One night, he decided to leave. \"I will go find a new place,\" he said. \"Maybe somewhere I will fit in.\" So he left the pond.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The ugly duckling walked and walked. He came to a marsh. \"Can I stay here?\" he asked some wild ducks. The wild ducks looked at him. \"You are too ugly!\" they said. \"Go away!\" The ugly duckling left.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "He came to a farm. An old woman lived there with a hen and a cat. \"Please, can I stay here?\" he asked. \"Can you lay eggs?\" asked the hen. \"No,\" said the duckling. \"Can you catch mice?\" asked the cat. \"No,\" said the duckling. \"Then you are no use to us!\" they said.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The ugly duckling had to leave again. Winter came. It got cold. The duckling was all alone. He hid in the reeds by a frozen pond. He was cold. He was hungry. He was sad. \"Will I ever find a place where I belong?\" he asked.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "At last, spring came! The ice melted. The trees turned green. The sun felt warm. The duckling came out of the reeds. \"I have been alone all winter,\" he said. \"But now I need to find food!\" He went to the pond.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "At the pond, he saw three beautiful white birds. They were swimming in the water. They had long necks. They had white feathers. \"They are so beautiful!\" said the duckling. \"I wish I could be like them!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The three white birds saw the duckling. They swam toward him. \"Oh no!\" said the duckling. \"They will see how ugly I am! They will laugh at me!\" He looked down at the water. Then he saw his reflection.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "He could not believe what he saw! He was not gray anymore! He had white feathers! He had a long neck! He looked just like the beautiful birds! \"I am not an ugly duckling!\" he said. \"I am a swan!\"",
      "emoji": ""
    },
    {
      "title": "",
      "text": "The three swans swam up to him. \"Welcome, brother!\" they said. \"You are one of us!\" The young swan was so happy! \"I have been lonely for so long,\" he said. \"But now I have found where I belong!\" The swans swam together.",
      "emoji": ""
    },
    {
      "title": "",
      "text": "Some children came to the pond. \"Look at the swans!\" they said. \"That young one is the most beautiful of all!\" The young swan remembered when everyone called him ugly. But now he knew the truth: He had never been ugly. He had just been different. And that was OK! The lesson: Be yourself! Everyone is beautiful in their own way! The end! EE words: see, been, feed, feet, seem, keep, need, tree, three, sweet, green, reeds, peep EA words: beak, each, mean, please, reach, teach, leaving, eating EE Practice Sentence: \"I can see three green trees where I can keep my feet warm and feed the birds!\" EA Practice Sentence: \"Please teach each bird to reach for food with their beak when eating!\" Rule: When two vowels go walking, the first one does the talking! - In EE, both E's make the long E sound: /ē/ - In EA, the E does the talking, A is silent: /ē/ \"Peep! Peep! Peep!\" \"CRACK! Out came...\" \"You are ugly!\" \"Please, can I stay here?\" \"I have been alone...\" \"I am not an ugly duckling! I am a swan!\" 1. How many eggs did Mother Duck have? (four) 2. What did the last duckling look like? (gray, big, different beak and feet) 3. What did the other ducks call him? (ugly duckling) 4. How did that make him feel? (sad, lonely) 5. Where did he go when he left? (marsh, farm, reeds by frozen pond) 6. What happened in spring? (he saw swans, looked in water, realized HE was a swan!) 7. Was he really ugly? (NO! He was just different—he was a baby swan!) 8. What is the lesson of this story? Track how the duckling FELT at each part: | Part of Story | Feeling | Why? | |---------------|---------|------| | Born | Confused | Looked different from others | | At the pond | Sad, rejected | Ducks were mean | | Left home | Lonely, hopeless | No one wanted him | | Winter | Cold, sad, alone | All by himself | | Spring | Hopeful | Sun came back! | | Saw swans | Amazed, scared | So beautiful! Will they laugh? | | Saw reflection | SHOCKED! | I'm a swan! | | Joined swans | HAPPY! | Found where he belongs! | Question: How did his feelings CHANGE from beginning to end? At the Beginning: - Thought he was ugly - Believed what others said - Felt like he didn't belong - Was sad and alone At the End: - Discovered he was beautiful - Realized he was just DIFFERENT - Found where he belonged - Was happy with other swans Big Change: He didn't change WHO HE WAS—he just grew into HIMSELF! The Lesson: You don't need to be like everyone else! Being DIFFERENT is OK! Questions: - Have YOU ever felt different? - Is being different BAD? (NO!) - Should you try to be like everyone else? (NO! Be YOURSELF!) - What makes YOU special and different? Remember: The duckling was NEVER ugly. Other people just didn't UNDERSTAND him! While reading, PAUSE and ask: - \"What do you think will happen when the egg hatches?\" - \"Where do you think the duckling will go?\" - \"What will he find in spring?\" - \"What do you think he'll see when he looks in the water?\" This builds prediction skills! - Stone Soup: Villagers learned to accept outsiders (travelers) - Ugly Duckling: Duckling learned to accept HIMSELF - Lion & Mouse: Small mouse was VALUABLE even though small - Ugly Duckling: Different duckling was BEAUTIFUL even though different - Pattern: DON'T JUDGE by appearances! Everyone has value! - Scene 1: Eggs hatch—CRACK! CRACK! Peep! Peep! - Scene 2: Other ducks are mean—\"You're ugly! Go away!\" - Scene 3: Duckling leaves—walk away sadly - Scene 4: Winter—shiver and hide - Scene 5: Spring!—stretch, sun comes out! - Scene 6: See swans, look in water, REALIZE you're a swan! - Scene 7: Swim with swans! You belong! Happy ending! Use different voices for sad parts vs. happy parts! - Left side of paper: Draw the \"ugly duckling\" (gray, different) - Right side of paper: Draw the beautiful swan (white, elegant) - Arrow between them: \"He was ALWAYS beautiful!\" Label: \"Be Yourself!\" What does ACCEPTANCE mean? Liking someone even if they're different Questions: - Were the ducks KIND to the duckling? (NO!) - How SHOULD they have treated him? (With kindness! Even if he looked different!) - Have YOU ever been mean to someone who was different? (Be honest!) - How can YOU be more accepting? Remember: Everyone is different in some way. That's what makes the world INTERESTING! Go through the story! Find all the words with EE or EA! Challenge: Can you find at least 15? Bonus: Make two lists—EE words and EA words! Billy the Goat says: \"The ugly duckling felt like he didn't fit in because he was DIFFERENT. Sometimes when you're learning to read, you might feel like everyone else is better or faster. But just like the duckling became a BEAUTIFUL SWAN, YOU will become a GREAT READER! You just need time to grow! Don't give up!\" Also: The duckling had to KEEP trying even when things were hard. When reading gets tough, KEEP going! You'll SEE how much you grow! 1. TONS of EE/EA words: Natural vocabulary (see, been, feed, beak, feet, mean, etc.) 2. Emotional depth: Kids FEEL for the duckling—builds empathy 3. Character development: Clear emotional journey from sad → happy 4. Universal theme: Everyone can relate to feeling different 5. Beautiful ending: Satisfying transformation (he was always a swan!) 6. Reading with expression: Emotional story = natural expression practice 7. Classic tale: Everyone should know this story! - Science: Swans vs. ducks (what's the difference?), bird life cycles, seasons - Social Studies: Acceptance, kindness, not judging by appearance - Character Education: Being yourself, self-acceptance, empathy - SEL (Social-Emotional Learning): Managing emotions, dealing with rejection, finding where you belong - Art: Swan illustrations, transformation art - duckling (baby duck) - swan (large white water bird with long neck) - ugly (not pretty, not attractive) - different (not the same as others) - acceptance (liking/welcoming someone even if they're different) - belong (feel like you fit in, feel at home) - reflection (image you see in water or mirror) - transformation (big change) This is by Hans Christian Andersen, a famous Danish author! This is one of the most beloved fairy tales of all time! Story Source: Public Domain (Hans Christian Andersen, 1843) BedrockELA Adaptation: February 2026 For use with: BedrockELA 1st Grade Curriculum, Lessons 43-45 Focus Skills: EE/EA vowel teams, character development, emotions, acceptance, being yourself **Perfect for:** Teaching vowel teams while teaching self-acceptance and kindness! \udda2✨💙",
      "emoji": "\ud83e"
    }
  ]
}